{
    "com.ubercab": "Join the millions of riders who trust Uber for their everyday travel needs. Whether you’re running an errand across town or exploring a city far from home, getting there should be easy. FIND THE RIDE YOU WANT Find the perfect ride right at your fingertips! Uber is here to make your journey stress-free and enjoyable. Pick from a wide range of products that the Uber app has to offer including: - UberX: Affordable rides, all to yourself - Uber Green: Eco-Friendly - UberX Priority: Priority pickup - UberXL: Rides for groups up to 6 - Comfort: Newer cars with extra legroom - Comfort Electric: Premium zero-emission cars - Uber Pet: Rides for you and your pet - Black: Luxury rides with professional drivers - Taxi: You now have the option to request a cab or a taxi in select cities - 2-wheels: Find a scooter to start riding today - Premier: Luxury rides with highly-rated drivers UPFRONT PRICING With Uber, you no longer need to worry about hidden costs or unexpected surprises. As you enter your destination in the app, you get upfront pricing and the estimated time of arrival. SAFETY TOGETHER Safety is a top priority at Uber. We have established comprehensive safety features to help ensure every rider and driver feels secure and comfortable. PRICING We’re doing all we can to make our pricing as transparent as possible. - UberX Share: UberX Share connects you to other riders headed in the same direction. - Group Rides: Share the journey with friends. - Split Fare: Split the cost evenly while you’re still on the ride. JOIN UBER ONE FOR EXCLUSIVE PERKS Benefit from $0 Delivery Fee and up to 10% off eligible delivery and pickup orders and 6% Uber Cash back on eligible rides. Other fees & terms apply. For more details see uber.com/uberone. RESERVE RIDES IN ADVANCE Need a ride at a specific time? No problem! Uber allows you to reserve rides in advance, so you can plan your day with confidence. GO GREEN Uber is committed to building a sustainable future for our cities. With a growing fleet of electric and hybrid vehicles, you can choose eco-friendly rides to help reduce your carbon footprint. CARSHARE Drive yourself with Uber Carshare. Borrow a car by the hour, day, week or longer – you only pay for the time you’ve booked. Currently available in select cities. RENT CARS AND HAVE THEM DELIVERED TO YOU Whether you need a car today or later, the online booking experience will help you find the right vehicle for a family vacation, a weekend getaway, airport travel, and more. You can have a rental car delivered to your door at the time and location of your choice with Valet, currently available in select cities. MORE FEATURES Delivery: Order food from your favorite restaurants through Uber Eats. Stock up on groceries, shop pharmacy, convenience and pet supplies and get them all delivered. Uber Connect: an easy, same-day, no-contact delivery solution that allows people to send items whether it’s a care package or an item you sold online. Transit: Say goodbye to complicated time schedules, hectic transfers, and unexpected waits while reducing your trip’s emissions. Uber Charter: Book high-capacity group rides in vehicles seating 14-55 passengers, such as limo buses and coach buses. Uber for Business: Manage and track business travel, meal programs, and more on one dashboard. Uber Hourly: Keep a car and driver with you for hours. Uber Car Seat: Uber Car Seat provides one forward-facing car seat for a child who is at least 2 years old, 22 pounds, and 31 inches tall. Get Started Now! Download the Uber app and create an account today. Uber is available in the following cities: Boston, DC, LA, New York, San Francisco, Vegas, Orlando, Chicago and more. Check if Uber is available in your city at Stay updated on the latest news, promotions, and offers by following us on Twitter at and liking us on Facebook at",
    "com.ubercab.driver": "It’s your hustle. Our flexibility. Your independence. Our security. Your business. Our support. Here’s why you should drive, deliver, and earn money with Uber. Drive or deliver. It’s up to you how you want to earn. No other app offers the same opportunities. Earn on your terms. Whether you want to use your bike or your car, you can make it work. Decide when, where, and how long you want to earn, while keeping your flexibility. Plan a smarter schedule. Exclusive app features like the Earnings Estimator can show you the busiest times to earn and keep a flexible schedule. Work from anywhere. Whether you’re in San Francisco, New York, or Austin, Uber is available in over 10,000 cities. Make money in your free time, then cash out when you’re ready. With Instant Pay, you can transfer your earnings up to 6 times a day. Enjoy the Driver app with Android Auto Accept trips, get turn-by-turn directions and earn with ease — all from your car’s screen. Sign up is easy. It only takes a few minutes to get started. Drive, deliver, and earn with Uber now. *This app typically uses 2 GB of data per month. Using navigation can decrease your phone’s battery life.",
    "ee.mtakso.client": "Use your smartphone to order a ride, get picked up by a nearby driver, and enjoy a low-cost trip to your destination. Why choose Bolt? • Get a comfortable, low-cost ride. • Fast arrival times, 24/7. • See the price of your ride before you order. • You can pay inside the app (Credit/Debit/Apple Pay). Easily request a ride with the Bolt app: 1. Open the app and set your destination; 2. Request a driver to pick you up; 3. See your driver's location on the real-time map; 4. Enjoy the ride to your destination; 5. Leave a rating and pay. Bolt features that require the app to stay running in the background: • Emergency assist: Riders can quickly and discreetly alert an emergency response team with our in-app Emergency Assist button. This also notifies our dedicated safety team, who will make an immediate welfare call. • Audio trip recording: Allows riders to trigger an in-app audio recording if they ever feel uncomfortable during a ride. • Private phone details: When a rider makes a call via our app, the caller’s phone number remains hidden. *We're dedicated to fostering greener cities, which is why we're continually looking to increase our lineup of electric and hybrid cars in our car-sharing offering, Bolt Drive. You can also rent Bolt scooters and electric bikes via the app. Our mission is to make cities for people, not cars. We're doing this by bringing fast, reliable, and affordable forms of transport to millions of people around the world, while also helping millions of drivers support their families. The next time you need a ride, take a Bolt! Bolt is available in 50 countries and 600+ cities around the world. *Bolt car and scooter rental options differ by location. Check the app for availability in your city. Earn money driving with the Bolt Driver app. Sign up at Questions? Get in touch via info@bolt.eu or at Follow us on social media for updates, discounts and offers! Facebook — Instagram — X (formerly Twitter) —",
    "me.lyft.android": "Get where you’re going with Lyft. Whether you’re catching a flight, going out for the night, commuting to the office, or running errands in a rush, the Lyft app offers you multiple ways to get there. EASY TO USE Enter your destination. See your route and ride cost up front. Choose Priority Pickup to get going quick. Boom. Done. Simple CHOOSE YOUR WHEELS Choose from Wait & Save, Priority Pickup, Bikes & Scooters, Lyft XL, Lyft Lux, Transit, or even Rentals. AFFORDABLE RIDES Our Wait & Save option helps you get around for less. And you can find the fastest public transit routes, too. * Lyft ride types may vary by region. Check the app to see what is available in your city. — Prices vary based on market condition. By downloading the app, you agree to allow Lyft to collect your device's language settings.",
    "com.ubercab.eats": "Get food delivery to your doorstep from thousands of amazing local and national restaurants. Find the meal you crave and order food from restaurants easily with the Uber Eats app. Track your order in real-time. FIND YOUR FAVORITE FOOD & RESTAURANTS Order food from nearby restaurants and search by cuisine, restaurant name, dish, and meal. Food delivery options for you to order and enjoy including pizza, burritos, burgers, sushi, donuts, and Chinese takeout. Prefer pickup? Skip the line and reservations and choose to pick up your order instead. Choose your favorite delivery options with the Uber Eats app now. SUBSCRIBE TO UBER ONE For $9.99 per month, Uber One subscribers enjoy $0 Delivery Fee and up to 10% off orders over $15 at participating non-grocery stores (and 5% off orders over $35 at participating grocery stores) available on Uber Eats. Members are also eligible for rewards, perks, coupons, and offers. View full Uber One Terms & Conditions in app. ORDER ALMOST ANYTHING, ANYTIME Order household needs from your favorite drug stores, supermarkets, and pet shops. Baby food or diapers, pharmacy needs, beauty products and cosmetics. Grocery staples like bread and milk, bananas and produce, flowers and plants, packaged foods or frozen treats. SIMPLE DELIVERY ORDERING Pick your food order from any menu and add it to your cart with a few taps. That’s it. Uber Eats makes it easy to order food delivery online or through the app and have it delivered by restaurants and delivery people near you. Or, schedule your order in advance for a delivery person to pick it up later. Your choice! ORDER FOOD AHEAD WITH PICKUP Now you can also order food ahead for Pickup instead of just ordering delivery. Select Pickup, add food items to your cart, and skip the lines to the restaurant to get your food. REAL-TIME ORDER TRACKING Track your food delivery order on a map as it heads your way. See the estimated arrival time at your address. Get notified when your order arrives. FIND SOME OF YOUR FAVORITE NATIONAL RESTAURANTS Some of our food delivery partners include: Pizza Hut, Little Caesars, Buffalo Wild Wings, Papa Johns, Shake Shack, Domino’s Pizza, Nando’s, Burger King, CAVA, A&W, Chick-fil-A, Chipotle, Dunkin', IHOP, KFC, McDonald's, Panda Express, Panera, Popeyes, Shake Shack, Sonic, Starbucks, Subway, Sweetgreen, Taco Bell, Tim Hortons, Wendy's, Five Guys, Jersey Mikes, White Castle, Jack in the Box, Outback Steakhouse, Red Lobster. FIND PHARMACIES, GROCERY STORES, AND MORE Order from grocers such as Albertsons and SEG. Other delivery partners in the pharmacy, convenience, and retail space include CVS, Walgreens, 7-Eleven, Wawa, BevMo!, and Gopuff. Order from stores such as Walmart, Walgreens, CVS and Safeway. Other delivery partners include Petco, Drizly, and Favor. ABOUT UBER EATS Uber Eats is the way to order the food you love through an easy delivery experience. Uber Eats is available in hundreds of cities around the world. Enter your delivery address to explore restaurant and grocery delivery options near you. AVAILABLE INTERNATIONALLY Join the thousands of others in your city who use the Uber Eats app to order from their favorites restaurants and schedule delivery Uber Eats is currently available in cities and metro areas including Adelaide, Amsterdam, Atlanta, Auckland, Austin, Baltimore, Brussels, Cape Town, Chicago, Dallas, Denver, Johannesburg, Glasgow, London, Los Angeles, Madrid, Melbourne, Mexico City, Miami, Milan, Nashville, New Orleans, New York, Ottawa, Paris, Philadelphia, Rio de Janeiro, San Diego, San Francisco, Seattle, Stockholm, Sydney, Taipei, Tokyo, Toronto, Warsaw, and Washington DC. Uber Eats helps you find food delivery around the world. See full list of available countries in the app.",
    "com.grabtaxi.passenger": "Get everything you need with Grab — the leading ride-hailing, taxi, food delivery, and grocery app in Southeast Asia. We offer essential everyday services to over 670 million people across Singapore, Indonesia, Malaysia, Thailand, Philippines, Vietnam, Cambodia, and Myanmar. Grab offers various ride-hailing options, including 4-wheel and 2-wheel rides, and taxi booking. There’s also a diverse range of services including food order delivery from restaurants, prompt package delivery, and groceries from supermarkets, making it a leading delivery platform. From ride-hailing to food and grocery delivery, Grab is your one-stop app for all your everyday needs in Southeast Asia. Book a ride for any occasion and budget Order a ride on Grab, the top ride-hailing and taxi app in Southeast Asia. Choose from a variety of transport modes, including cars, motorbikes, and buses, and get matched with a professional driver in minutes. Food delivery for any craving GrabFood: a leading food delivery app that allows you to easily order food from your favorite restaurants and get it delivered to your doorstep, making it convenient and hassle-free Conveniently order food and groceries for delivery GrabMart is a convenient food delivery app that allows you to order groceries and handpicked fresh produce from your favorite supermarket. Secure and seamless cashless payments GrabPay: A safe and secure mobile wallet where you can easily pay for Grab services, such as food and grocery delivery and taxis, as well as at local merchants Reliable on-demand package delivery GrabExpress: Order affordable, fast, and reliable courier service with insurance for your items Rewards for using Grab GrabRewards: Order food, ride and earn reward points for every dollar you spend and use them to redeem deals in the GrabRewards catalog Grab is the only ride-hailing and food-delivery app you need. Whether you are searching for a taxi app, express food delivery, or grocery delivery, Grab has got you covered. In addition to our renowned ride-hailing, taxi, and food delivery services, we also strive to promote economic empowerment for everyone in the region. We provide financial services such as wealth management, lending, cashless payments, and insurance. Find out more about us at Grab offers the ability for users to receive personalized targeted advertising, offers, and updates from Grab and its partners and communications/advertising from certain third-party apps based on activity on your devices. Users may exercise opt-out choices under the Privacy and Consent Management sections within Settings within the app. For further details, you may refer to our Privacy Policy at",
    "com.cabify.rider": "Whether you want to move around the city in a cab, order private car rides or send your things from one area of the city to the other, Cabify is your transportation and mobility app. And without giving up the most important thing: the safety and quality of your trips. Cabify, the safe transportation option for your trips. Reach your destination in a premium cab or private car. How does it work? 1. Reserve or request your car or taxi ride. Indicate where you are located and select your destination, as well as the type of transportation you want to use: Cabify, cab or delivery. 2. Confirm your request to order a trip and that's it! We will provide you with the details of the car or taxi and the driver, either for a trip or for a delivery. 3. Get to know the estimated price before traveling. We will tell you how much you will pay for your car or cab ride. In addition, you can select the payment method that you prefer: debit card, credit card or cash. 4. Share your journey. Send the details of your trip to family and friends so that they know where you are at all times and make you feel even safer. In addition, you will always move with maximum safety measures. All users - drivers and passengers - must travel with face masks, the cars and cabs are cleaned and ventilated frequently and have a divider panel. What are the advantages of traveling with Cabify? 🚘 The safety of your trips is our priority. All trips are geolocated and can be shared immediately with any family member or friend. They will be able to see which taxi or car you are in, which driver you are with, and even where you are in your trip. 🚘 Easy to use. You will be faster than Usain Bolt ordering a cab ride or making a delivery. 🚘 Delivery. We don't just move you, we move your stuff too. Our drivers will take what you want from one place to another in their cars or motorcycles. 🚘 More options for you. Because we know you don't always travel the same way, we have free cars and cabs for every occasion. Cabify for your day-to-day trips, Taxi to get there as soon as possible, or Delivery to receive what you want. 🚘 Carbon neutral trips. We offset all the CO2 emissions generated by your trips with Cabify. Choose a transportation option that thinks about the environment! 🚘 The best drivers. At Cabify we have the most selective criteria accepting car or cab drivers. 🚘 No surprises. We show the price before you request a trip. This way you can travel with the peace of mind of knowing how much you are going to pay. 🚘 100% customization. You decide how to move. Choose from the payment method that best suits you to what beat you want to play on your radio. 🚘 For everyone. Cabify's app is accessible for people with sight impairments, and we have accessibility settings for people with disability. Where is Cabify available? Cabify is now available in 8 countries so you can get around by car or cab. Order your taxi driver in cities like Bogota, Lima, Madrid or Buenos Aires and start enjoying more transportation options with the leading taxi app: car rides, motorcycle deliveries, airport cabs, and more. Get to know all the services available in each city at cabify.com. In Cabify we improve every day by integrating new apps and services like Easy Taxi & Easy Tappsi, so you can move wherever you want freely and safely Want to use Cabify for drivers and become a taxi driver? If you're passionate about helping others discover your city, download Cabify Driver. Looking for corporate transportation for your company? Offer the best transportation app to your employees. Open a corporate account to have a large fleet of cars and cabs available for your company's trips and deliveries. In addition, our management platform will allow you to have greater control of expenses. Download Cabify, your car or taxi transportation app and move or send whatever you want around your city.",
    "sinet.startup.inDriver": "inDrive, formerly known as inDriver, is a revolutionary ride-share application that boasts a presence in over 600 cities across 48 countries. Best of all, it’s completely free to use! We're a new kind of rideshare app. We started up from scratch in 2013, and since then we've grown like crazy all around the world. And now we're bringing our game-changing rides to the USA! It’s an excellent taxi alternative for your trip. You can either find a ride or offer your own driving services through the app, making it super convenient and flexible. inDrive is a great ride-sharing option for rides in Miami. MORE CONTROL Set the price you're happy to pay for rides and choose the driver you want to take you FAIR PRICES Our rides are cheaper because we don't charge drivers big fees SAFETY FIRST Vetted drivers, in-app safety features and a dedicated 24/7 support team As a driver, you have the potential to earn more than a traditional cab driver using a standard transportation app. This is because you have the flexibility to create your own transport schedule and select which rides you wish to take. Why Choose inDrive (a ride app or a driving app) LOW SERVICE PAYMENTS FOR DRIVERS We keep our service payments as low as we can, and they'll actually be 0% for six months from our launch. We think it’s fairer this way. To us, you’re not just another driver who should simply take the rides we give you at the price we decide — no way, you're one of the team. QUICK AND EASY Requesting an affordable ride is quick and easy with this ride-share app. Simply enter your starting point (A) and your destination (B), set your desired fare and select a driver to get started. OFFER YOUR PRICE We understand that finding a reliable and affordable ride can be a stressful experience. That’s why we want to offer you an alternative to traditional cab booking apps. With inDrive, you have the power to customize your rideshare experience. You can choose the driver you feel most comfortable with and set the price that works best for you. CHOOSE YOUR DRIVER With inDrive, you have the power to select your driver from a list of those who have accepted your ride request. In addition, unlike other taxi booking apps, we offer you the freedom to choose based on factors such as price, car model, arrival time, rating, and the number of trips completed. This unique feature sets us apart as a preferred alternative to traditional cab apps. STAY SAFE Before accepting a ride, you can view the driver’s name, car model, license plate number, and the number of completed trips. This level of transparency is not standard in traditional taxi apps. Additionally, our app includes a “Share Your Ride” button, allowing you to share your trip details with family or friends. Our team is dedicated to developing new safety features to ensure a completely secure experience for both riders and drivers. ADD EXTRA OPTIONS By using this alternative taxi application, you have the option to include any specific requirements or additional information in the comments section, such as “traveling with my pet” or “carrying luggage.” The driver will be able to view this information on their driving app before deciding to accept your request. JOIN AS A DRIVER & MAKE EXTRA MONEY If you own a car, you can make extra money with our driving app. Unlike other cab booking apps, inDrive lets you view the passenger’s destination and price before accepting the ride. If the price seems inadequate, inDrive offers the option to suggest an alternative price or decline the ride request without penalties. Moreover, this car booking app has low-to-no service rates, meaning you can make more money while driving with this taxi app alternative. Whether you are looking for a new driver app for your trip or need a ride in Miami, you can get a unique rideshare experience with this great cabs & taxi alternative. Install inDrive (inDriver) to ride & drive on your terms!",
    "com.taxis99": "99 is the biggest Brazilian e-hailing app. Our mission is to revolutionize mobility and transform people's lives. With few taps, you can request a car or taxi and also decide how you pay for it, whether it's with cash or straight in the app, where you'll have access to exclusive promotions! Why request a 99 ride? Power of choice We have several options for you to choose how to move around in your city. Cars with private drivers, taxis or rides billed to your company through our corporate vouchers. Every moment in our day to day asks for a specific solution and it's you who is in control. Where are we going today? Safety first 99's partner drivers go through a rigorous selection process. They rely on in-person and online training to ensure all the safety and comfort you deserve. The cars are comfortable and inspected, and of course, we keep a close eye on the passengers' ratings. That reminds us: don't forget to rate your last ride! Fair rates Our service is the most cost saving option in the city. And since transparency is one of our key values, we will always provide you with an estimate of how much you'll pay before you request your car. And with our newest feature, you can also track your POP ride's price in real time during your ride! Smart-wallet 99's coupons are smart! If you have more than one in your wallet, the app itself shows you the best discount before ordering your car and applies it automatically. Keep an eye on your message inbox and do not miss any of them. To enjoy our fantastic discounts, you must register a card or PayPal account in the app. Easy to use Just open the app, choose your destination and you're done! 99 has the best technology in the world to find the right driver for you, and in minutes a car will arrive at your doorstep. Also, talk for free with the driver, by text or audio, using the new feature chat within the app. Feeling like driving with 99? Come join us! Download 99 app for drivers and register here: WHAT'S NEW This new version is a totally upgraded experience! Enjoy amazing discounts on your rides and discover all the new facets our service has to offer.",
    "com.didiglobal.passenger": "Do you need a ride? Or are you craving for a pizza? Ride wherever you want or order food delivery with DiDi, the world's largest mobility app and professional food delivery platform! Order a car in just three taps and travel more relaxed a comfortable. Order delicious food from your favorite restaurants with fast delivery. Download the app and enjoy our special discounts! Download the DiDi Rider app now and guarantee a quality, economical and safe private transport service. You can also enjoy great food anytime, anywhere. Order your favorite pizza, hamburger and tacos. A complete app to make your day easier. 🚖 DiDi offers these services: 🚖 DiDi Express: cheap and safe trip with a qualified driver. DiDi Economy: cheaper travel, but with the same quality as the DiDi Express. DiDi Taxi: request a taxi by cell phone to travel more comfortably (available in some cities). DiDi Delivery: deliver or receive your order, package or document cheaply. DiDi Flex: you choose the price of your trip. DiDi Food: enjoy great food anytime, anywhere DiDi Moto: Enjoy better rates and faster rides 💸 More savings on your travels and safe deliveries 💸 With the DiDi Rider you can travel economically! Order a taxi or a private driver and take cheap trips wherever you want. Do you want a mobility app where you can save money? Then download DiDi Rider! 🍕Food Delivery🍕 Order food from restaurants easily with DiDi! In just 3 simple steps, you can enjoy your favorite delivery without leaving your home. 👮Your safety is the most important thing👮 Safe travel first. All DiDi drivers go through a selection process, where only the best are judged. With an extra step of security, you can share your trip in real time with trusted contacts. In an emergency, press the safety button. Travel safely with DiDi! 💳 Choose your payment method 💵 Select the best payment method, credit or debit card, via the app, or cash payment (only available in some cities). DiDi offers discount coupons and exclusive promotions for you to travel cheap. Enjoy it! 📱Ease of ordering cheap travel deliveries📱 With DiDi Rider you can travel or order package deliveries with ease. Just enter your current location and destination, and we'll find the nearest private driver or taxi driver. You can see the driver's location in real-time and how long it will take to arrive. Request one of our services, such as DiDi Taxi, to travel cheaply on the largest transport platform in the world! 🗺️How to request a trip on the DiDi platform🗺️ Download the DiDi Rider app and create an account. Enter your location and destination. Select payment method: credit card, debit card or cash payment (available in some cities). Click \"Confirm\" and we will find a driver nearby. You will be able to see all vehicle and driver information, including their real-time location and how long it will take to arrive. Give your opinion at the end of the trip: so that DiDi maintains its quality of service. With DiDi Rider, you can order safe travel, fast deliveries and enjoy a low fare and a private transfer service with a qualified driver. Also, you can choose to pay cash or card when ordering a cheap trip. 📢Need some help? 📢 Visit or contact us at help@mx.didiglobal.com or call 800 988 8888.",
    "com.booking": "Save on your next trip with the Booking.com app! Find great hotel or apartment deals and book in just a few minutes. You can also book flights, rental cars, and more through the app. - Book your whole trip in one app (accommodations, flights, car rentals, taxis and more) - Stay flexible with free cancellation (available at most properties) - 24/7 customer service in more than 40 languages - No booking or credit card fees - Chat directly with your property in the app - Enjoy mobile-only discounts - Use filters to easily find the perfect place out of millions of available accommodations (hotels, apartments, homes, villas, ryokai and more) - Get paperless confirmation of your reservation — no printing required - Manage your bookings on the go, making changes whenever and wherever you want - Discover local attractions and make the most of your trip - Share your experience and get local advice on our Travel Communities forums Access millions of accommodations From cozy country homes to funky city apartments, find the perfect place out of millions of available accommodations. Our app offers hotels, apartments, hostels, vacation rentals, resorts, motels, guest houses, and bed and breakfasts. Quickly find the perfect place to stay Filter hotels by price, review score, WiFi quality, and other things important to you. Search cheap hotels by city, attraction, landmark, or hotel name. Special requests? Pet-friendly hotels? We have filters for everything. You can also compare your favorite accommodation options side by side to ensure you get the best price and quality. Deals for any budget Discover daily accommodation deals and save on your next hotel, apartment, or villa booking. Get exclusive mobile-only discounts of 10% or more on select properties when you book in the app. Savings available on motels and hostels, B&Bs and resorts, and luxury hotels, inns, homes, houses, apartments and vacation rentals. Find your ideal accommodation at an ideal price. Stay flexible with free cancellation Change of plans? Not a problem. You can cancel for free at most hotels, apartments and other properties on Booking.com. And the app makes things even easier — it only takes a few taps to cancel, and you’re free to find a place that better suits your needs. Last-minute travel Heading somewhere in a hurry? With the app, you can quickly book hotels at the last minute (as well as far in advance). Finding a place in short order has never been easier. Our app allows you to search for properties nearby, fill in a few details, and secure your reservation. You can also change, cancel, or make additional reservations on the go. Jet off with the perfect flight Book domestic or international flights on the go with ease. The app allows you to search thousands of airfare deals per day. Plane tickets available for all major airlines and destinations. Hit the road with car rentals Car hire has recently been added to the app. Whether you just need a ride to explore your destination, or you’re going on an epic road trip, the Booking.com app can help. Rent a car from all the major companies and hit the road! Reserve taxis with ease Book in advance for a seamless connection from the airport to your destination. You can also book taxis to and from other pick-up points, such as hotels and local attractions. Find and book a great experience Whether you’re looking for attraction or museum tickets, boat tours, or walking tours, you can book experiences online in minutes, with free cancellation on many options. Get and share tips with other travelers Connect with fellow travelers, share your experiences, and get local advice on the best accommodations, attractions, and more. Discover new experiences with our app, the perfect trip planner."
}