{
    "com.ubercab": [
        "Uber is one of the bestest 😎 way for raid it is the best and but sometimes it not find the cab earlier but this only the problem 😕 and all is good and fine 😄😄",
        "Excellent",
        "Very comfortable travel",
        "Excellent Service",
        "ok",
        "One of the worst cab service provider. They dont have a live interactive customer care service or customer care number. Even if your driver dropped in the middle of the road you cant do anything. They also rate the customer means even if you say put AC to the driver he will give you bad rating in the App and that idiotic rating will come up in your profile. NEVER USE Uber, Ola is much better to use [they never rate the customers]",
        "The guy is very good 😊 and Car is clean and smelling nice.",
        "It has become a source of confidence that I will be cared for to and from my destinations.",
        "Always higher price then OLA and I daily book cab since last 3 years but never found rate cheaper on uber.",
        "Usefull",
        "Good drivers",
        "I have great experiences with each driver. Safe, easy to use, very convenient",
        "Great",
        "Nice",
        "Very good experience 👍🏻",
        "So far I'm very happy to use Uber. Very much convenient for me.",
        "Very effective.",
        "Great",
        "Waste app there is no customer support contact number everytime Because of some or the other payment I need to pay extra charges",
        "Good sarvice",
        "Perfect.",
        "Good",
        "Good",
        "Nice",
        "Great app, I love everything about it",
        "Good",
        "Froud app don't install",
        "Convenient",
        "Reliable!",
        "Excellent",
        "Huhh",
        "Not proper drivers",
        "Awesome",
        "First ride was very good driver was a nice person",
        "Good",
        "Good",
        "Good",
        "Good",
        "Very bad services by riders.Most of them are fraud and will waste your time.",
        "Nice ride",
        "Very good",
        "Good",
        "The prices and drivers are nice",
        "I use the Uber app for both rides & Uber eats. How this app has 4 star reviews blows my mind. The Uber eats section is not customer friendly at all. Orders are messed by the restaurants, wrong sizes are delivered yet there is no adequate channel to lodge this complaint and have it sorted. This morning I ordered a hot chocolate that came a size too small. No assistance from the Uber app and no refund. How can I be expected to pay for additional for a larger drink and I receive the small one?",
        "Always provide lowest fare and drivers are polite.",
        "Nice",
        "Cheap quick",
        "Nice",
        "Needs more accurate Improvements while navigating local areas.",
        "Good",
        "Great",
        "supper smart",
        "Difficult to get in my area.",
        "Good",
        "On time n humble driver nice experience 🙂🙂🙂",
        "Had very good experience with recommended 👌 must download it, and enjoy the easy way rides any where..",
        "He is a good driver",
        "Nice ride",
        "Good drive",
        "Nice application",
        "Excellent APP. Excellent service. Excellent product. Delightful to use 😀 😊 👍",
        "Good service",
        "the real price charge was not matched the price when I made booking.",
        "fast",
        "Good service",
        "Good",
        "Nic",
        "Good 👍",
        "Good",
        "good",
        "best app ridding",
        "First trip with uber rides and I requested for my son and he's happy",
        "Whether it's an uber ride or an uber eats order, the couriers are on time as well as efficient traveling to a destination for an uber x.",
        "OK",
        "Osm",
        "The app is overall good but giving it one star rating since they have such a big engineering team and still don't have a feature to upload picture of where you are standing. Often in the app pin location could go incorrect, especially if you are in a new place. Many times uber is overriding the location that we input too. Picture is the must have feature for road systems we have in India. Please add it to the app.",
        "Great",
        "Ecxilent drive smooth and comfortable",
        "The best established transport business",
        "Good",
        "Good 😊",
        "nice ♥️",
        "A great app to go out and drink and be responsible by not hurting or killing someone. I know this is harsh, but time for people to step up and be responsible.",
        "I have downloaded uber app for travel but every time I had booked it always comes late or sometime they cancelled.. because of their late ...I had to cancel my rides two time .and took rikshaw...very bad service",
        "Driver force customer to cancel the ride",
        "Good service and payment saving .",
        "It is very useful for me",
        "Good",
        "Tiempos de espera muy largos",
        "UI is very heavy as compared to ola, it seems that data transfer happening in realtime to US or UK server. What makes uber to take 3 times space than ola app?",
        "Very good",
        "Fast and reliable compared to ola this is far better for the response timing",
        "hey so not being able to contact support about paying for a ride you already paid for is dumb. I can't reach anyone and my acct statement said it's already paid for.",
        "Very bad app",
        "This app is terrible. There's no transparency on the charges, and rides are booked at one rate but the final bill ends up being double. Plus, there's no way to report or inquire about the high charges.",
        "I don't know what the company is doing at present They always increases fare at the end of the ride and on complaints they just don't provide solution. Now I have finally decided to switch on other app As compared to other platforms they relatively show high fare 30-40 rs higher .",
        "Good",
        "Good",
        "Very nice 😍",
        "Good",
        "I love the experience very good app 🥰🥰",
        "Safest and most trusted mode of transport anywhere and at anytime.",
        "Punctual, dependable, professional",
        "Its good.",
        "Uber’s service in Bangladesh falls short of expectations. Waiting times often exceed an hour, and customer support is virtually non-existent. Many drivers lack professionalism, making the overall experience far from satisfactory.",
        "Ghatiya application ever i used......",
        "Very very good right normal kiraya comfortable",
        "Good",
        "Uber used to have a lot of drivers in my area. Now it's pretty much an auto rickshaw booking app for me. It's sad.",
        "So far so good",
        "I pay for uber one but still receive ads in app. Theres no feedback option outside of help regarding specific rides/delivery or billing in relarion to rides/delivery",
        "Excellent",
        "Great experience with uber",
        "Its ok",
        "Improvements have been made",
        "Certain points to be considered by Uber : 1. Waiting period is increasing. 2. Old fleet 3. Cleanliness inside the car not maintained.",
        "If your riders are not ready to go at lower fares do not keep this saver riding options, not a single day it happened that they have accepted to go at lower fares. Really disgusting app!",
        "Good",
        "Nice service",
        "Mujhe urgent hai isliye bich raste me gadi cancel kr rha hu Sorry 😔 Driver good car condition veri good",
        "Your app donot work. Past couple of weeks seen that fares are very high in all cities where I have travelled",
        "Rates Reasonable comfort to ride with family",
        "Comfortable ride, easy to confirm ride, affordable price",
        "Good job keep going...",
        "Nice app and immediately response the ride.",
        "Best price and service",
        "Good",
        "Living on treasure island, we get alot of canceled trips, but the second driver to show up tonight was awesome (sushant)",
        "Super",
        "Had a very long day at work. Driver was great. Carried my bag and put in trunk and unloaded when I reached my destination. Great service",
        "Not supportive and unnecessary charges applied 😕 the app isn't as user friendly as it claims to be",
        "Absolutely trash app. It'll send you to the wrong place, even when putting in the correct address! So sad!!",
        "Who doesn't live Uber they actually... Lol?",
        "They charge a low amount when you accept then after trip they come back to charge your higher amount e.g my trip was R127 when I accepted it when I got off it was R197. I didn't make the driver wait at all but they always have additional charge from nowhere.Secondly I lost items and they didn't help me.Its a good app but horrible company kindathing",
        "Excellent",
        "dont use Uber often. had a great driver and clean car",
        "Kind sweet and safe ride!!!!",
        "Great experience using this service so far",
        "Very bag charger tomany times",
        "Good 👍👍 Great",
        "Although my app is updated but still not having the option to add UPI payment method. Sorry to say its a bug in the app.",
        "This app is terribly confusing. I am sure that it confuses people on purpose so they end up spending more money. In my scenario I was supposed to have two vouchers for a ride to and from an event, but of course it still charged me for one of the rides. Looking at the way the app coordinates, I can see that's to be expected. And so many people think, \"it is what it is\" and they pay it and go on. I won't use it again.",
        "This app proved to be very useful in hospital cases emergency The driver was polite and even in the midnight the taxi was available I strongly recommend this app for emergency transportation",
        "Good",
        "Pathetic service.",
        "Great person and service",
        "Good service",
        "Got a scammed again by drivers who pretend they're lost so they can charg3 you double for making YOU wait. Was not only followed and harassed by a driver but now I repeatedly get \"oleg\" who rips you off. Stay away from uber. Especially if you book a ride though the uber eats route. SCAMMER CENTRAL",
        "Easy to move",
        "A little more expensive than Lyft, however there's way more options on rides, and even rentals!",
        "Very polite and class",
        "Good 👍",
        "Ordered a Uber in Vegas the pick up spot wasn't possible to get to in time, I messaged the driver she came and got us where we were! Said it was also easier! Uber then changed the rate and tried charging my credit card 15 times but it was unauthorized so card got blocked for .30 cents! What a headache will be using lift and taxis from now on!",
        "Frequently crashing",
        "Nice",
        "very nice",
        "Good experience",
        "This aap is good",
        "Better for all ride",
        "good app",
        "আসসালামু আলাইকুম",
        "Very good service",
        "Very good",
        "Easy to use app!!",
        "Perfect thanks",
        "Good 👍",
        "Excellent",
        "Super 👍 app",
        "Weri gud en sef drive",
        "It's nice 🙂",
        "My ride arrived 10 minutes early and made good time. I needed to get to my destination before it closed. He got me there with time to spare. I see why he has a 5 star rating.",
        "So far great experience",
        "Ok ok",
        "Bad!",
        "I'm a F traveling alone in São Paulo, BR. I had only 15% battery when I booked a car that had a +20min wait, It canceled. This went on like 6 times. I was put in a situation where I was alone, at night, with only 5% of battery and on the verge of crying. My boyfriend finally got to order an Uber, they came only when he ordered the most expensive one. On the ride I could see how the driver was rejecting trips probably bc of this same reason. IDK what the deal is in BR but you need to stop it!!",
        "Best Service and drivers!!!",
        "I'm so glad this service is available. And Teen Uber has really helped our family as well.",
        "Reviews",
        "Always there to take me wherever I need to go... Thank you Uber",
        "Used Uber for the first time. So easy to get a ride, Frank was an excellent driver and I felt like I made a new friend by the end of my ride. Definately will use Uber again in the future.",
        "Charged me repeatedly without telling me or sending receipts. Found out through my bank that I apparently had subscription with this junk of an app.",
        "Really Good",
        "Good",
        "I would leave no stars if I could. Most of the drivers are illiterate and if you contact support they don't help. Get ready to be robbed of your time and money because they don't refund and the support sucks. If a driver cancels a ride you get charged $5 automatically. I was fine with that but when a driver brought my $75 Uber eats order to the wrong address and they denied my refund.... I said I'm deleting this app. Don't waste your time. The support has reached out to me and resolved the issue",
        "My driver today was very excellent. Very knowledgeable. And knew his way around town good job Uber, see you next time.",
        "Good service",
        "Awesome 👌",
        "Nice trip",
        "This app sucks didnt respect my friend",
        "Good job",
        "Very sweet, respectful driver",
        "Super app",
        "Funny !! Friendly !!!",
        "I never had any bad experience with Uber, their drivers are professional and friendly, keep up the excellent work Uber.",
        "gud",
        "Charles was a very good driver. Very nice and professional.",
        "It's fun! Not having a car isn't a problem anymore!",
        "Exllant",
        "Good work",
        "good"
    ],
    "com.ubercab.driver": [
        "3rd class app , rapido captain app is more smooth and advanced , uber should have own app wallet scanner like rapido . But unfortunately it's missing",
        "Superb",
        "Really job satisfaction",
        "good",
        "Good",
        "ok",
        "👍 nice",
        "best app for business",
        "Uber is total fake app customer is amount 83 rupees and app is 96 rupees and customer is only my pay 83 and Uber is 74 rupees pay 5.1 km total froud app only customer support auto rickshaw driver no support 😔 this app is total fake customer care number is busy ola and rapido is best app no my issue thanks ola and rapido my family fucher no booking and customer care service total frund Last day no next time not login by by uber totally lost Rs.14 1 km ola & rapedo app 17 per km",
        "good",
        "Hi Uber ur also told zero commission But he was amount add to wallet what the And long order to ur not add extra earnings No waiting charges all amount add our wallet",
        "Disappointed since I am a great candidate to run for their company. Smh. Matt",
        "Need to remove the mandatory appear on top setting.",
        "every thing is perfect but problem is rider is not getting trips it's taking too much off time",
        "nice",
        "not able to connect support team it's ringing from past 2 hours but still not connected to the executive I feel intentionally u guys are not connecting without a valid reason blocking trips mentioning taken offline trips and not connecting to customer support to discuss very pathetic service moreover u have reduced the fare charges for drivers drastically which is too frustrating gor drivers not able to earn good amount company should into fare charges or u may loose drivers",
        "Very bad app.Uber company does not care about car owners.They are doing good to customers by offering offers and robbing car owners. The company should not be taken over. A company that is benefiting consumers at the expense of vehicle business owners should be taken out of India",
        "Horrible app. Take off the mandatory overlay. This is atrocious and costing me $$. This makes everything so much harder and worse. Use doordash instead.",
        "Bekar app auto valo ko lutata hai",
        "good service",
        "good",
        "Forced overlay setting. Most recent update broke everything",
        "Forcing overlay is a deal-breaker i'm going to be driving for doordash a lot more an Uber a lot less just get fuct!",
        "good",
        "Please mere driver ID bahut hi salon se block ho rakha hai please help me khol do main bahut hi pareshan hun mere ko kam dham nahin mil raha hai isliye main gadi chalana chahta hun meri ID apne aap hi block kar diya gaya tha please help ID khol do sar ji nahin to main fansi Laga lunga ramdham kuchh bhi nahin mil raha hai",
        "Horrible company that is forcing a \"draw over\" permission now that completely breaks the app and locks up my phone on top of the massive pay decreases that''ve constantly been happening. Overly controlling and completely disrespectful to their drivers.",
        "waste application, don't use this application full fraud, customer service also negligence",
        "This app, the policies of the company, and driver support (at least in regard to food orders) have gone downhill so much, esp. recently, that delivering for UberEats has become a truly negative experience and definitely not worth the trouble. I would strongly discourage anyone considering downloading this app and beginning delivering with Uber Eats from doing so.",
        "I would only recommend this app if you cannot get a job anywhere else, maybe because you're criminal, you have no high school Diploma. Or maybe you're an illegal immigrant, otherwise work anywhere else. Make less than minimum wage and destroy your car. The app is malware, it was almost banned from the apple store and if Google did their due diligence it would be banned from play store for violating android ToS",
        "Terrible app!!! Terrible company! Terrible support. Terrible pay. Company relies on exploiting drivers to stay in busines. No pay for canceled orders! Little to no live support. Company removed phone support and $3 cancellation pay for drivers. App is always glitching and sending you to pickup up orders that have already have been picked up. Terrible experience with this horrible company. If could've given zero stars I would've. Highly recommend looking at another hustle or source of income.",
        "Good to me thanks",
        "The overlay feature is dangerous and disruptive while driving. STOP forcing drivers to enable this feature.",
        "Idk where to even begin complaining. 3 years I have been watching this app go to the trash. Terrible support that are speaking broken English, that u can only text with. The pay is super low, and they bank on making it so frustrating to use that you will quit. As of October 2024, the app now wakes up your phone from sleeping, turns lock screen off completely, then accept orders screen in your pocket. If you try to cancel the orders and YOU are held liable for fraud and will be deactivated.",
        "If I could rate this app a zero I would. Where to start? Other drivers steal food, I just got off the phone with \"Raymond\" (right...) who basically told me \"too bad so sad get rekt\" after a driver stole someones food and I had to drive over 10 miles for Literally nothing. The driver got free food, I got no money, and the customer is hungry. Uber. Your policy is not an Effective strategy and unless you want to go under I suggest you change in a timely manner. This doesn't look good for you.",
        "Yo, the always-on display is not ok. It is dangerous for your cancelation rate and you can not see where you are potentially driving. I use Google maps and listen to music so it's not uncommon for UE to be in the background.",
        "Uber now forcing me to have their stupid app on top all the time. Hello 25% cancel rate. I'm sure I'll accidentally accept many offers I have no intention of completing because I'll be doimg other things when an offer pops up under my fingers.",
        "You can't rate businesses pick ups and customers the way customers and businesses rate UberEats drivers. At least in Uber X both driver and passenger can rate each other.",
        "There is no help for drivers. You have to go through a chat. Lately they give you rides and orders that are either taken by someone else or were canceled causing you to waste time and money. Work doordash and Lyft",
        "I understood the rate was &14.50 per hour from 8pm until 1058pm. I received less than $25.00 for 3 hours and several deliveries and only received 1 tip. I will not be working with Uber Eats in the future. I lost money on gas. All my deliveries were made early and was professional to customers. your company is deceptive and under pays employees. I feel used.",
        "This app no longer gives the addresses where you are going. The streets it lists as cross streets are blocks apart and do not cross. We can no longer tell how close a pickup is to where we are. App now tries to start the trip before arrival or before drop off causing the screen to lose the directions and then lag when trying to get back to the directions. Accidents will happen. Uber will not respond to me. Now it forces you to overlay the app on all other apps. Not going to happen uber. I quit",
        "I love uber achi ride deta ha uber",
        "Forced overlay on the app ruined my phone they need to not force anything on us. I can't open the maps to see where the order is going. This is illegal",
        "good",
        "Worst app ever. I wasted my time and money driving to pick up food delivery orders my phone behaved as though the orders were brand new. I accepted him and drove to the restaurant the first restaurant to Uber order had been picked up hours ahead of me getting there. And the second order I did the restaurant had been completely closed for hours. I wasted my time and money and Uber said they could not compensate me. This was my first time using Uber and I'm so upset.",
        "Forcing me to have an overlay app that's distracting when you're trying to drive. Shame on you Uber! You're causing traffic accidents and I hope you get sued!",
        "Why is overlay required to go online?",
        "no order low rate warest app",
        "22-24 % commission in Bangladesh. It's a torture for uber driver .",
        "🤩",
        "I should not be forced to use push notifications to go online that's ridiculous.",
        "Unsafe forced overlay feature now mandatory to be enabled.",
        "ok",
        "The app itself has frequent unnecessary updates like the most recent today. I now have to have an Uber bubble on my screen whenever I am logged into the app. Very unnecessary it doesn't give them an advantage over other apps it just annoys me and make me more unlikely to use it. It's my phone not yours. As far as the service goes, for those not careful, they will like end up losing more money than you make. Basically modern day slavery.",
        "Uber mein preference ka jo box hai...usko zbrdasti Lago kr diya gaya hai ..k aap ko sedan ' Access Priority chalna hoga...srf Intercity nahi kr skte aur city mein 3/4 km pickup kijiye Aur Airport ' Railway station krte rahiye..aur Intercity mein v return opportunity abhi tk waisa hi hai jaisa k 3 saal pahle tha...isi liye ab uber mein maza nahi aata...jb k 29000 trip 4.93* rating 10 saal pura kiya humne ...lekin uber aaj v wahi hai...jo kl tha..\" woh Malik hum Naukar \"",
        "Again driver is getting paid less it's not worth it . Atleast in India.. the price it gives is way less",
        "Genuinely terrible, bordering on illegal, and deceptive practices by this company make it among the most dangerous, and lowest paying independent contractor jobs in the world. If you want a complex way to remove equity from your vehicle for cash in hand that day then go ahead and download this app and start driving.",
        "good",
        "Very very good",
        "App Overlay permission is now required This app keeps getting worse! Rideshare rates are laughably awful! They also deactivated my account for an accident that wasn't my fault when I wasn't online with them!",
        "Crooked people who don't payout the drives you go on",
        "The App breaks regularly and they recently force us drivers to use the app with overlay over every other APP. Which is especially dangerous during driving and takes control over our phones away. And watch out for the yearly renewed background check, because they take over a week to get it done. And they won't let you work during this process, even without any Criminal Record. It's honestly insulting pay half of the time too.",
        "Please disable new mandate requiring \"display over other apps\" . It's dangerous and leads to more accidental accepted orders which creates a service problem.",
        "There's many issues every time new updates done. Just gets worse something always not working and just more new annoying popup messages. Acceptance rates only goes down not up most of the time.",
        "If you guys continue to allow tip baiting, my reviews will continue to be negative. Update 10/28/24; the stupid overlay should remain optional. Not forcing it down our throats",
        "This app is consistently horrible and support provided to Diamond drivers is non existent. The mapping software is constantly sending me to the wrong address. The app loosing signal all over the city (Denver). There are no options in the app for \"problems with the app\" which is 95% of the problems I encounter driving for Uber. Today I cannot go online at all due to a map overlay permission requirement which is already allowed on my phone. No one in support can fix. Sell the stock immediately!",
        "So all Uber Delivery drivers your not getting tips anymore on the uber app because uber has removed the tip option off the app and replaced it with the radar ,So in other words uber is charging customers almost 5 dollars extra to put there orders on radar keeping the money for themselves abd screwing there drivers yet again , This is nothing but corporate greed ,Uber pays way less then other Deliver apps if you can deliver for skip or doordash or who ever else is in your area do it",
        "👍",
        "Appear on top ruined the app. I use to be able to be on a different app and hear an order come in and I could switch back over to uber and see where it was going. Now I have an annoying half screen and can't see where it wants me to go and I can't switch back while an offer is coming in. Terrible and dangerous",
        "One of the worst company in Canada that exist and the word is spreading trough my town not to make business with them.they pay 3$ per trip and they expect the costumer to tip well so you can get your order while they charge already to costumer overpricing",
        "Try to open up the app tonight and sign on to get some work done and the app is requiring me to turn on app overlays. I do not want app overlays on ever. I do a lot of work on my phone multitasking, and I don't want to accidentally accept something that I cannot complete. This is an invasive use of the app on my phone. I will not be delivering for Uber eats until this is changed.",
        "Drivers are forced to do rideshare",
        "شكرا",
        "Makes you do appear over the top or can't go online!!!! and I hate that option because you accept deliveries by accident while texting a friend etc. And can't see the route only the distance and fee Go back to the old way!!!",
        "If you don't take any low paying order that they throw you. They cancell your account",
        "very good",
        "best driver app for",
        "Worst App",
        "Thank you for your help. You treat the client very well.",
        "Best app",
        "Best",
        "Apphang or offline jatahe",
        "Varest",
        "it's changed and I don't know why",
        "5Eyras",
        "Best",
        "ok",
        "अच्छा करने के चक्कर में इसने अपने ड्राइवर ऐप का नाश कर दिया और इतना कम टाइम कर दिया की call accept भी नहीं कर पारहे हैं",
        "Very interesting and learning",
        "Ur my life leader tqsm🙏🥰🥰😍🤩",
        "Worst app ever used I called customer care but no response and they could not solve my problem. App is showing your vehicle not allowed in city. So many time I informed customer care chat but not solved Phone contact support worst ever",
        "love it so much",
        "Good news for every partner in odisha ,uber is go on in November 1 ,govt app is ready for ride bcz uber is too low fare in bhubaneswar every rider was discussed with govt ,govt was new lunch in bhubaneswar",
        "Jada pise gheun raide suvida nai ani gadya pn clean nai sagle khrab sarvice bad bakwaas app",
        "super💐",
        "Stupid app wrost app bekar app sale ka app kuch bhi kam nahi karthe is app me wrost app i have ever ban this wrost app in india",
        "Uber pass is annoying n bcoz of that I stop using uber as it won't let u go online if u have 1 rs minus balance such useless business policy n idea by uber rather genrate u r own qr like ola n clear all negative balance in wallet as u have very less customer who pay on uber app.",
        "Uber is tha best plateform for extra income sors thank you uber moto",
        "Instant settlement eases my daily expenses.",
        "thanks ubar",
        "Now a days uber waste taking monthly commission platform charge 900/- each rider",
        "gud",
        "uber is very good for arning monny",
        "thanks for uber",
        "good",
        "They are trash I wanted a fast ride so I paid 35$ for 13min I had to wait 19min and they still charged me smh they r trash then they changed my address it's a mess zero star",
        "Thank you for a extra income",
        "😡😡😡🙏🙏🙏 Uber",
        "good 👍",
        "It’s getting worse every day. Today, I accepted a ride that initially showed a fare of 610 rupees, but by the end of the trip, I received only 443 rupees. According to company policy, they should only charge a 20% commission on the trip amount, so why are they charging so much more?",
        "No one who is new to this accident should rush in. When they first come, they will give a lot of orders and after a few days, they will go to hell.",
        "perfect 👌",
        "Uber staff will work only till 6 or 8 pm uber drivers will work after this but no support from uber only deducted 25rs for today for only one trip after this no trip will assist",
        "good times",
        "isme sirf customer ko hi faida he gadi Wale or Draivar ko ye log kuch nahi ginte ekto inke paas hame Jo problem hai uska option nahi hota or ham call kare bhi to kese sare options nikalenge nahi ho paya to sorry kahke Chet khatam kar denge jis din Draivar ko koi or option mil Gaya us din se ye company Wale option dhund te rah jayenge",
        "great 😃👍",
        "There is no money in it for uber eats delivery drivers. Waste of time and effort. The fare should be the same as ridesharing, no tip. This would solve the problem.",
        "very good",
        "I am not satisfied",
        "Paisa bahut kam deta hai",
        "nice rides",
        "8/7/23 GPS lags, gives wrong directions, and has the wrong address pinned at times. When issues have come up, customer support has been more frustrating, than helpful. 9/1/23 App goes down a lot and has cost me more than what I'm making, support is a joke with 90% of them can't/won't help with issues. Engineering is 100% not available. Regretting working with Uber. 10/28/24 tried it again and the app and customer service, account service, and supervisors are useless!",
        "superb",
        "Would have been no stars, So even after my background check came back. Still can't drive for uber. No tickets, no marks on license but yet I can't drive. Guess ya'll lost someone who would have worked for Uber for a long time. Guess I'll stick to driving for another company. What a joke! I won't even use Uber for rides anymore either. Guess you need a bad driving record to drive for Uber.",
        "When the order comes shows the high amount with less kilometres and when ride accepted it'll show you the long route and less amount worst app ola is much better than uber",
        "Excellent",
        "I have completed all the sign up processes and all the documents have been approved but it still won't give me the option to upload my vehicle and is forcing me to rent. Can someone contact me so I can upload my cars details. I paid a lot of money to get the car approved.",
        "Poor app",
        "I love 😘 this 🤩 app",
        "Good",
        "No comments",
        "Pay is so little, and Uber charges you money for using the app 😒",
        "Third class app",
        "Hidden charges of 25 rs, if we will do single ride per day also, worest uber and customer care never responds and call also they won't pick",
        "Very nice I appreciate with you all time dear uber",
        "osam",
        "I'm not happy with app and staff services",
        "Super app",
        "very poor",
        "Useless, unprofessionals and without responsibilities work in the support team.",
        "Please give the 0 star rating option in the App Worst app no customer service not responded in emergency moment charged extra platform fees not good for riders worst experice don't join this company please 0 star",
        "Uber Saying 0% commission But Daily 30₹ cutting Commission For What ? Not giving continuous rides not giving proper earning fuel waste time waste and what about the hard work for finding rides in going the circle of demand area total wastage vehicle service is not for free uber...",
        "Pretty good my only Complaint is When Passengers want a Two drive without Music like I'm Sorry for wanting to Hear music in my own Car to Drive You Home. Other than that I Recommend Uber Driver to Anyone",
        "Iske bharose koi bhi gaadi nahi bhai log auto se bhi kam Paisa deta hai",
        "The customer support system is terrible. The app's help menu can only help with a few selected problems yet some need to be explained and that option is not given",
        "Super",
        "ఉబర్ మనీ కస్టమర్ కేర్ , కానీ కస్టమర్ సపోర్ట్ వాళ్ళు గాని, అకౌంట్ ఆక్టివేట్ కోసం 2 నెలల నుంచి ట్రై చేశాను ఆయన అవ్వట్లేదు ఏం చేస్తున్నారో ఏమో, కస్టమర్ కేర్ వాళ్ళ బ్యాక్ అండ్ చెక్ చేస్తున్నామంటూ అంతే, ఇంత వరస్ట్ సర్వీస్ గాని రెస్పాన్స్ గాని నేను ఎక్కడ చూడలేదు దయచేసి గమనించగలరని మనవి 🙏🙏🙏🙏🙏🙏",
        "Good jove",
        "Worst app designed by dumb people. Every update add more problems to app. Uber need to hire good programmer and spend some money on app updates. It frustrate the drivers and customers both but uber management doesn't care about it, they are just focus on earning money any how.",
        "Worest experience with uber",
        "What the hell is wrong with uber support, all screenshot proving Customer changed the address and i travelled more 7km and invested my time, u are not giving me my payment... I am not going to deliver next time if customer ask me to deliver at other address i will take picture at pin point and complete delivery. Worst ever customer service by any kind of company and app, Even doordash and menu log is better than you, you are humiliating your riders, i will gave this rating on you app as well",
        "Bad fair in uber",
        "Waiting to receive decision fróm United States of America to recoup $2000 Social SECURITY OFFICE from Advocates Rep Payee to buy ELECTRIC BIKE UBER EATS DELIVERY JOB",
        "Tea break options not getting to me, Drivers feedback system also very poor server also poor condition in kochi",
        "Love it",
        "Hi, What went wrong with instant payouts in the UK ? Unless we call customer service it doesn't work , on top still it takes at least a day to get the money of instant payout on which we pay a quick processing fee of £0.50. kindly get this instant payouts back to normal. We don't get monthly wage. Our Everything stops when we don't get instant payout. We can't buy Feul, can't pay bills everything stops. Please fix it asap",
        "Nice application for very useful 👍",
        "Terrible ui and trying to change anything dealing with your banking information is a miserable task that will take hours to complete. Going over to lyft to see if they are any better.",
        "Very Helpful app for university Students",
        "bed experienc uber driver is froud company.",
        "good",
        "Ok",
        "Bad experience technical no support Uber partner",
        "Worst customer care support",
        "good",
        "Very very good",
        "Too many bugs and app keeps crashing. Support is terrible. It's really bad when you need it and it doesn't work. VERY unreliable. And Support don't seem to care! They think resetting your phone fixes everything!?! Absolute nonsense! And they don't want to pay FAIR FARES. THEY LOVE RIPPING DRIVERS OFF",
        "the pay could be better.",
        "Bahut hi ghatiya aap h driver ke pese be vajah ke cut kr leta h , commission bhi bahut jada leta h. Na costumer sport no milta h na chat ka option aata h. Bakvas ap h .",
        "Whats this nonsense i i stalled the app because i have to hurry but my time is wasted because its a driver side app. You should do the same procedure in one app",
        "The app has a glitch (very common if you Google it) where it will not allow you to add update or change your debit card so I contact support and they ban my phone for security I'm able to login on PC and an old unactivated phone... So yeah they banned one phone for security... It makes no sense they won't do anything they are holding my hard earned money hostage",
        "Uber fraud taking 40℅ commission from driver and also not helping them when tey have some issue",
        "Not a shabby side job.",
        "PTA nahi kya kya uplode karne ke bad bhi bolte hai uplode kro",
        "This app price is very low. Very low arning.",
        "Charging more and commission also taking for after minimum rides there is no customer support to talk",
        "Good App to earn",
        "Very bat",
        "ನಮ್ಮ ವಾಹನ ತಕ್ಕಂತೆ ಮತ್ತು ದುಡಿಮೆಯ ಪರಿಶ್ರಮಕ್ಕೆ ಸರಿಯಾದ ಹಣದ ಬೆಲೆ ನೀಡದೆ ನೀವು ನನಗೂ ಮತ್ತು ಇತರರಿಗೂ ಮೊಸ ಮಾಡುತ್ತಿದ್ದೀರಿ ಮತ್ತು ನಿಮ್ಮ ಸಂಸ್ಥೆ ವಾಹನ ಸೇವೆ ಮಾಡಲು ಯೋಗ್ಯ ಇರುವುದಿಲ್ಲ.",
        "Rider se 21 rupye daily le rhe ho uske baad 10 persent comition bhi kaat rhe ho or call support pe call nhi lagta h driver kitni bhi emergency me ho koi matlab nahi",
        "cool",
        "I 😄",
        "Good bat parsh lo",
        "I like to be helpful and driving my car and it's nice to earn some money and rewards for helping people out. And to be honest it's also nice to travel around.",
        "I only delivered food. Horrid experience compared to Doordash and GRUBHUB . I did Uber eats for one month. many times, I was sent an order that was already picked up. once the counter woman I knew from Doordash said I was the 5th driver there! I called Uber support, and they said, just said \"sorry to hear about your experience,\" then just cancel the order, and you can go get the next one. Many times, I was sent to the wrong delivery locations. Just bad compared to other companies.",
        "Good",
        "Can't recommended uber anymore, pay is too low for drivers",
        "is good for part time,but we using the car and fuel and We spill the time,so supposed uber give more money.",
        "Worst app don't instal this ... Even not getting one trip I waited over 2 hour and three hour... Nowadays uber dabba app",
        "App kept crashing and gps lost while going to rider... this issue has been here for a while.",
        "Most worast app 🤬😡",
        "My life oppertunity thankyou uber driver app",
        "It's OK, not as good as Door Dash, by a long shot. Your area is wherever u say no to. We drove 15 miles out and no tip. That was the last time. It doesn't show you what the tip is if someone put it in before u took the job so most orders are under $5.00. Then pray that u get tipped.",
        "wowe ubber no words for you you arw rhe best",
        "There is no respect for the committed drivers in public service. This company doesn't understand the politics of taxi driving and / or public service. They have this (Pro) algorithm that expects drivers to accept every offer, yet with no knowledge of sense of what the offers are. The algorithm is not set to send rides logically to help a driver's earnings. Yet, it is engineered to cap your money according to the hourly standard that is installed into the applications algorithm.",
        "Fix the surge heat map. Please.",
        "I feel good when I receive money.",
        "Uber every time cut their daily charges also with every trip but on cancel trip by the customer they jst pay 5 to 6 rupees some times they don't pay any... Today this type of nonsense got another level, I was on the high demand area for 2.5hr and received not a single booking. I was on my last trip to get 850 rupees extra, I travelled from point to another to jst get only one trip but due to no booking available I jst missed my incentive...",
        "good app Uber",
        "It could be a lot better.. but they seem to be working to make it better.",
        "App is super buggy and support won't fix the issues or your metrics. Metrics effect your pro benefits and promotions and etc. This is probably illegal."
    ],
    "ee.mtakso.client": [
        "affordable and quick",
        "the best app",
        "excellent",
        "good 👍",
        "excellent",
        "Good driver",
        "Been riding many times.",
        "safe drive",
        "Good service ever",
        "nice drive",
        "safe and reliable",
        "Excellent driving Car in good condition Very nice gentleman",
        "Excellent job",
        "best",
        "the app is the best",
        "Excellent customer interface",
        "good service",
        "Awesome i enjoy it",
        "A humble person with good attitude",
        "take",
        "good services",
        "Convenient",
        "excellent driver.",
        "Works well when in Bangkok",
        "It was my first time using it. I really felt safe because he waited for us to open and lock the gate before he left. I'm impressed. Keep up the good work.",
        "Good",
        "supper",
        "sometimes other drivers are so incompetent which makes the ride feel unsafe",
        "Bolt is the best",
        "absolutely great service",
        "perfect service",
        "👍 good",
        "convenient",
        "nice",
        "They have a quality motor nd experience driver",
        "very on time",
        "Love this app when in Europe. Top drivers and very professional..",
        "Excelent service",
        "wonderful",
        "Good service and friendly driver's",
        "thousand outa 10",
        "good",
        "excellent serious",
        "bolt is on point 24/7",
        "good",
        "qwephesional",
        "Greatest",
        "sharp man",
        "gkojh",
        "fast and reliable.",
        "good driver",
        "whenever we request for a bolt we need a straight transport, so please try not to accept if it's gonna take you more than 15 minutes, if you do accept please immediately talk to your client to ensure she/he's fine with your time.Thank you",
        "excellent service",
        "Very nice man",
        "courteous",
        "okay",
        "It asks to provide birthdate and trying to get scooter or bicycle you are rejected because too young to drive. I waited for support for half hour with no response. F you and your services.",
        "This app is charging me a waiting fee when the driver didn't even come to the right location and I walked to him which took me time.",
        "this platform is affordable",
        "satisfactory",
        "fantastic",
        "nice person",
        "Keeps crashing when trying to schedule a ride",
        "wonderful Ride",
        "always on time",
        "okay 👍",
        "best ND fast",
        "Best Prices in Thailand. Very reliable!",
        "l really enjoy using the app it's affordable",
        "Fast, quick and time saving",
        "valid",
        "Nice",
        "okay",
        "excellent and fast. I really appreciate",
        "very kind and helpful",
        "Timely",
        "good",
        "Great",
        "💯💯💯💯💯",
        "very good transport and safe",
        "Where are the custom services? how can we resolve our overcharged issue",
        "what an excellent driver. friendly & patient enough.",
        "nice very professional driver",
        "Rare discount",
        "Driver is absolutely amazing, great sense of humor",
        "the best driver of others",
        "very fast with safety",
        "l booked a ride from home to school l don't know what was wrong with but now it's improving",
        "Morning I love you so far We have 3 4 3 🙄 🛡️prw0r🇸🇰🇸🇭🇱🇨🇸🇯",
        "After installation, I've tried several times to sign up with no success on the matter Don't know what the problem is! 😕",
        "i didn't receive my money back after cancelling a trip",
        "Только положительные впечатления. Машины всегда есть, цена нормальная.",
        "It's annoying to realize that the price it's showing on the rider's app is lower than the driver's. And even at such, the drivers lack discipline and they keep begging you to add to the money. Fix that pls!",
        "excellent service 👍",
        "Time track is 100%",
        "haina mbambamba",
        "good driver",
        "Over charged",
        "excellent drivers",
        "excellent service n very safe ride",
        "good happy 😊",
        "best service if the all",
        "best",
        "awesome",
        "sport on",
        "Grea",
        "💯",
        "I so much love to use bolt ride",
        "drivee was gentleman he drop us on airport very smooth",
        "The best 👌",
        "I requested a bolt and it was saying 43r but I ended up paying 62 this is unacceptable at all am deleting it that is why I prefer uber because bolt has no good service 🙄🤨🤨🤨🤨🤨🤨🤨🤨🤨🤨🤨",
        "Great experience,Friendly drivers and always on time. Thank you",
        "was good",
        "Excellent",
        "nice ride",
        "Always on time",
        "excellent",
        "amazing ❤️🤩",
        "Horrible...I canceled my ride so they took more than 20% I'm going to report this",
        "excellent",
        "Why would u show me a piece then show the driver another price and cause unnecessary arguments between us That's unprofessional, please work on it",
        "very good driver",
        "good",
        "DONT USE BOLT. I won't even give you 1 star but I have to. I have had a very bad experience with them. I get cancelled and them a message saying they are all busy. I won't use bolt again. If you use bolt u guys are going use them u will end up with a bad experience too",
        "Excellent",
        "No report office for complaints Tried reaching out once to no success",
        "good service",
        "it's fast nd easy",
        "Just the fact that directions to the pickup point from Zagreb airport was given with photographic aids makes the app exceptional",
        "good drive",
        "good and safe",
        "very cool 😎",
        "good",
        "Very friendly and nice",
        "verynice",
        "he's cool",
        "لو فضلت الاسعار كده",
        "RR tee hee e?",
        "Great service",
        "Very good",
        "excited with the ride and it's safe",
        "it's so good",
        "Driver very friendly ,good hospitality to his customers",
        "Bolt is a good partner in the transport business.",
        "attitude 👎🏿",
        "cool",
        "fast and reliable transportation",
        "شاب خلوق وذوق",
        "Exallent mode if transportation for all cities in TZ",
        "good service",
        "fast",
        "The best drive ever",
        "Good App",
        "Good",
        "The app it's self is affordable BUT it's NOT THE SAFEST APP , ITS EASY FOR DRIVERS TO USE FAKE PROFILES OR USE EACH OTHERS,SO CUM WITH A DIFFERENT CAR AND A DIFFERENT PERSON ALL TOGETHER THEN WHAT YOU SAW ON THE APP WHN SELECTING THE RIDE.ALL AND ALL CHEAP TRIPS BUT THE SAFETY IS LOW",
        "I'm fed up of going to a bicycle with no battery",
        "very good driver",
        "Worked great, got us a driver in no time. Showed where he was, all the vehicle details and ride cost. Good job.",
        "Nice option to have for now",
        "good",
        "Easy Fast drivers",
        "Excellent",
        "Price doubled",
        "App used to be good, but now it's terrible. Impossible to get a driver unless you pay surge pricing. Feels like a scam now. I have above 4.8 rating so that's not the problem.",
        "good",
        "bolt is the best",
        "He quoted me a price but changed the price upon arrival",
        "Awesome 👌",
        "great app",
        "The drivers don't accept trips from townships which now makes it not a preferred option than other eHailling companies",
        "brilliant driver amazing cool driver 10/10",
        "Everything was great",
        "good ans understanding driver",
        "it's a good app and a safety app",
        "This driver was taking on his phone from Croydon costco to my house and spitting aswell in Africa language. That's nice . please have a word with him to stop this behaviour when is a passenger on his car .Thanks",
        "Excellent service 👍",
        "Nice application since I make money on my own schedule",
        "very good n patient",
        "it's a nice app with nice drivers.",
        "Perfect service!",
        "I love it",
        "is good",
        "Awesome service",
        "👌",
        "good service",
        "he was very friendly to us what a nice guy✌️✌️✌️✌️",
        "No cancelation option. My driver left me midway on the highway and i was waiting for 30 minutes with no cancelation option.",
        "It is one of the worst customer support. I had to use this app for when I traveled outside. My app was showing different charges, and the driver app was showing different overprice charges. Finally, I paid driver charges and escalated to customer support. They took more than 2 days and closed the ticket without a solution.",
        "easy transportation",
        "I love mm",
        "Great",
        "اول تجربة واخر تجربة السائق اخلاقه سيئة والتواصل مع خدمة العملاء بالرد الالي ولا توصل معاهم لحل لا انصح به",
        "Great safe drivers inexpensive prices for rides top bins",
        "bolt is the best option",
        "good",
        "The worst customer service I have ever experienced among all similar apps",
        "Improve",
        "awesome",
        "good service",
        "amazing ride"
    ],
    "me.lyft.android": [
        "Will not work",
        "Let's see.....",
        "Good night 7",
        "Will update after trial",
        "Emailed the address in the google store w a problem. Got a bounceback that its no longer a working account. Why is it posted.",
        "I loaded the Lyft wallet for $25.00 CAD They charged my Canadian bank card $33.50 USD. Then I ordered a ride and they didn't pull the money from the Lyft wallet. Then they said it would be refunded,( 5-7 business days, it's been 21 days)he emptied my Lyft wallet and NEVER REFUNDED THE MONEY.",
        "Lyft is awesome! From what I've seen waaay cheaper than Uber, and also has a feature for women that's super cool! Highly recommend!",
        "Horrible platform. Horrible customer service.",
        "The best!",
        "scott was great all the way around . .",
        "Driver was 30 minutes late for a scheduled pickup, which I tried to cancel after waiting for 15 minutes. Charged me for the ride and offered no contacts for customer service/dispute.",
        "Lyft is a complete scam they charge you a ride fee up front before they will even pick you up however that fee changes drastically they charge you by the minute before your 5 minutes wait time is up then trying to get ahold of someone because of the multiple extra charges they make it impossible to argue your case. Their drivers don't follow app protocol when you arrive at a stop or when you leave the stop allowing for both Lyft and their drivers upcharge your account. Be aware of the scams",
        "yep I've been a customer service his first inception",
        "This company is a scam. They let me load my lyft wallet but won't let me spend it or refund the cash. Avoid and just use Uber or local alternative.",
        "Lyft is total garbage now. Last week, a scheduled ride picked me up 25 minutes late to get to the airport. Today, a driver sat in the parking lot for 25 minutes, ignoring my calls and messages in the Lyft app, until I finally cancelled. Then, I got assigned another driver and the same thing happened again. They just sat around in the airport parking lot until I got fed up and cancelled. And there's no way to contact Lyft support when this happens. It's totally ridiculous.",
        "Requires too much info just to check pricing. Guess I'll stick with Uber lol",
        "No way to dispute a charge or complain about a ride. \"Ride doesn't qualify for a refund or credit.\" Dead end.",
        "Great",
        "Company can't pay living wages to their employees thus as a customer you will be nickeled and dimed for everything. Nicer car pay more, faster service pay more, lock in prices pay more. A whole lot of bait and switching too. Advertise pick up at one time actual pickup time much later. They just count the money they don't care about you as a customer",
        "I like the app but I don't like that none of the coupons I find dont work",
        "Absolute, awful customer service. You can't call anyone with a problem. Their email team doesn't get back to you. Awful service",
        "Haven't used them yet",
        "I'm trying to get home fast, but this guy takes his time charging his car before picking me up. I ordered the priority, and he made me wait 30 minutes to an hour when he shouldn't even have taken my request. This is horrible. I mean, what if I was supposed to be at work or school. Never again am I using a lift until I get recompensated or at least a coupon or something. Also, he wasn't far away, so it's not me being unreasonable. It said 5 minutes away, and I waited an hour. I even walked to him",
        "Absolutely awful app experience full of dark patterns and no customer support outside of a small list of frequent pay/ride issues. Push notifications do not work and it's just awesome to get text messages about every ride plus a few afterwards to see if I need help because it always believes I didn't reach my destination.",
        "Simple to use",
        "Use this rideshare regularly;",
        "Paid for ride for tomorrow, will I get ride on time? Need help with your customer service",
        "Every driver I have is courteous, and respectful, and they like to have a conversation to make the trip go by faster. This is a great company",
        "Always too expensive...",
        "There has been a few changes that has made me like this app a bit more but I'm starting to think Lyft Pink is pretty much useless. There should be absolutely no reason for the prices to absolutely skyrocket out of nowhere and the discount for Lyft Pink doesn't even help.",
        "Once again, this app robs you i put my address for my price lock and lyft changes it to Southeast, when I had it to Northeast and they're telling me that they can't change my address.This place always robs me out of my money",
        "They charged me triple the upfront ride quote without notice or any reason. Never use your bank card with them because they will charge a much higher price without notifying you. They have no customer support either.",
        "What a fun alternative to walking. Had an incredible experience. Loved it!",
        "Great",
        "Price gouge. Price for ride was $7 then changed to $30 within 5 minutes such a rip off. Cheaper renting a car. Will no longer use. $30 just to go five miles. Then I found out from a driver most of the money doesn't go to them. Lyft paid a driver $9 and and charged me over $20. Rip off",
        "so kind and didn't give up finding us with very congested traffic. thank you Lynda!",
        "better fares than uber!",
        "While the driver are mostly awesome they way they direct their drivers is ridiculous. They take longer routes waiting time and gas. The directions always suck and take 5 to 10 minutes longer to get where you're going when there's a quicker faster route. Maps are out of date. Very inconvenient when u need to be somewhere.",
        "Ride can not be canceled for no car seats 2 kids",
        "The drivers will take you anywhere you want to go",
        "Prices in Seattle are wild! No way you can justify such short trips being so expensive. Uber are you are definitely working together to drain us all.",
        "thank you my best friend teresa and community life uplifters in roanoke im oraying for you guys love reginald brantley, muse, bashan",
        "I had a horrible experience. Lyft totally ruined my night. So I used the delayed ride feature and waited for a cheaper ride to arrive. However no driver came to pick me up. Even when the time ran all the way down and said \"driver is seconds away\" even then I waited 15+ minutes for no one to show up. Eventually I gave up and cancelled my ride and called an Uber to go home because I was so frustrated and tired at this point. Even though it was more expensive, at least they showed up. Lyft sucks!",
        "This app is great in a pinch if I cant find an Uber. But everytime I try and go for a ride with Lyft it is always over $100 for a 10 minute ride. That is robbery.",
        "Drivers cancel and ride right past you. No regulation at all.",
        "They make you sit there waiting for driver verification but no one ever shows up. Ever. I waited for an hour for them to find me a driver, but they kept me in limbo. Then I had to find a very late night expensive uber, but thankfully that driver was fantastic and top notch.",
        "Never download Lyft never take a Lyft because they won't refund you even if their fault they have poor customer service and they lie about everything I don't recommend it's not worth the price the drivers are rude and they call you names and Lyft excuses their behavior.",
        "too expensive",
        "Sometimes they are cheaper than Uber but they also tend to change the price on you and it will be more than a day later. I'll get one price then a day or two later I'll get an email about an \"updated price\" where they decided to jack up the price after the fact. I think it's unethical and tells me I can't trust the company. I only use them as a last resort.",
        "My Toronto trip took a frustrating turn when I was then left stranded and charged for two additional rides that never came, I disputed the charges but costumer service never got back to me, the issue dwells from the fact the driver was a couple streets away so I can't submit an automatic complaint I have proof I wasn't picked up and will share my google maps GPS data. Lyfts unwillingness to deal with the issue has left me looking towards litigation.",
        "fun to ride scooters",
        "No way to log in to exciting account or create a new account due to errors. Update: error still happening as of Oct 2024. Have not been able to log in the past few years, even after 2 factor verification due to system error",
        "Closed my account for giving someone a rating",
        "Overpriced rides, sometimes this app steals money from my bank account for rides I never took, the male riders are usually rude.....such a waste!",
        "Lyft is significantly more expensive 90% of the time so download Uber too, prices may be different in your area. Lyft will constantly \"find you closer drivers\" but it seems like they're bumping you down the queue as wait times just increase. I can't count how many times this has caused me to be late for work. I got their \"ride pass\" or whatever and had an awful time cancelling it, i swear i had to cancel it like 5 times after seeing random $2.99 charges on my statements",
        "Don't have a car. Glad to have transportation for when it rains. I ride my bike or walk everywhere.",
        "I planned a weekend away for my wife on our anniversary. I scheduled a Lyft to take us to dinner 3 days ahead of time and 5 minutes before our ride was supposed to show up, the app said \"looking for new driver\". And we ended up driving ourselves. Not happy. What's the point in scheduling a ride?",
        "saw saved my chicken 🐔 😋",
        "I use you guys everyday to go to work bur you guyshave caused me significant stress drivers canceling or that there are 4 or 5 drivers nearby but tgey won't take mine. Today I waited since 245 but it kept saying sorry ev3h though there were drivers look I don't care if my bill is nine dollars or more you guts promise service if I can't rely on you I'll use Uber. I wish I could pick qnd choose but you also should have the person paying for ride be allowed to pick closets driver driver no show",
        "I don't know y they charge too much and have me wait 20 minutes. I'm not wit it",
        "Very good transportation app!",
        "can't find my lyft cash on the app. this has never happened with Apple version",
        "I had to get to work at 1 pm, i ordered a Lyft and it said they were going to arrive at 12:49 so I was going to be 4 minutes late. that's fine. but then It was canceled for no reason at 12:49 so I'm gonna be 30 or more minutes late",
        "I always have problems with this app it never works and it always have a hard time adding my card I've missed many appointments due to this app",
        "cool driver",
        "It was a cell phone that was lost in the car on side of the passenger back door",
        "If you dont have a call the map shows only north you go 2 destination the gps Go wrong way",
        "Lyft really needs to do better got Robbed of 19.86 for a ride I didn't receive is crazy do BEETER",
        "Has not been working for 5 years so I use Uber",
        "I had a driver steal my belongings, and there was no way to contact support for help.",
        "My drivers are amazing",
        "Pricegouging",
        "Easy to use app, cheaper rates, lovely drivers!",
        "Impossible to schedule rides",
        "This app is garbage. Driver's constantly dropping rides. Waited 3x what I was told.",
        "my client was transported back home from a Day Program Park Center back home to 3113 Anderson Road Antioch 37013 he left his Cell phone in a Lift car belonging to a Mr. Justin driving a dark Gray Dodge Charger tag# BGZ3571.",
        "definitely had more than a few Lyft rides go from $20 to $40 magically the moment I hit the pay button.",
        "Loading \"See driver details in...\" for 12 minutes, then cancels ride. Twice. Unreliable app",
        "I can not stand lyft they make u late by taking the longest rout smh",
        "Quiero tenerlo en mi teléfono para Aser viajes seguros para dónde quiera que",
        "The time estimates aren't even close",
        "AAA+ excellent way to get a ride.",
        "Wants my credit card number before it even gives me the cost",
        "great driveee",
        "Every driver we've ever had was exactly on time. That means everything.",
        "Perfect everytime",
        "Thank you for your services",
        "Wow, I just noticed that the \"custom tip\" is not working so whatever I put in there was not registered. Wow, how stupid is this!!",
        "I have been over charged a few times with this service. This last time to get less than a mile down the road they were trying to charge me 46.99 for the cheapest service. Nothing but a rip off!",
        "She's the best!!!!!",
        "Requested a ride to wonderland. Driver dispatched. Arrives at pickup, leaves without me. Second car doesn't even show up to the correct spot. Both drivers ignore my attempted calls. I was charged 20 bucks for a no show. Find ANY other ride service.",
        "WOMEN+CONNECT, AWESOME COMPANY WITH INTEGRITY",
        "Support is non-existent. Absolutely no way to change nor remove your default tip outside of rides and the app will force it regardless of what you input during the ride. Massachusetts drivers get $32.50/hr and have become shady with rides. A lot of drivers don't care and just milk it. Lyft doesn't care.. as long as everyone has 5 stars and guaranteed tips, right?",
        "i dont like the fact i cant delete my credit card. No reply from Lyft app about my concern. Wow. I am surprised that a big company like Lyft didn't bother to respond to a post.",
        "Overpriced use Empower",
        "Will not let me call a lyft or even see prices",
        "I have been a driver and a rider using the LYFT app. Great all around experience!",
        "I can't remove my credit card from the app - shady shady shady...",
        "Wowo literally deleted my comment about getting ditched instead of picked up after waiting 15 minutes. And it just happened again their needs to be some recourse or reimbursement for wasting riders time. Also, If you're drivers can't be reliable, they shouldn't be preferred.",
        "All I wanted to do was try to get a refund on a trip that would normally take 20 minutes. Your \"estimated time\" said 8 minutes - fair enough, rush hour traffic makes sense. I waited for a driver for 30. Didn't even get a \"thanks for waiting.\" He then proceeded to go 5 minutes in the opposite direction before changing course. I've had some great drivers and memorable trips, but if you can't even provide a client feedback section, or even a way to contact customer service. You've lost a client.",
        "Drivers don't speak English and on their cell phone or have ear buds. Teach your drivers how to conduct themselves.",
        "better prices than uber",
        "This company is a company of snakes and scam artists never ride or drive with these a**hats",
        "Price gouging by surcharge during morning rush hour (75 to 100 dollar fares). Price lock is deceptive advertising. Unreliable service at night, which impacts workers with nontraditional schedules. I have had multiple scheduled rides at night that have not shown up or keep me in queue for an hour. Lyft is getting worse.",
        "Worst customer service imaginable. Literally steals your money. I bought a $25 lyft card 5 months ago with what little cash I had at the time and not only did it not work, months later I am still trying to access these funds. After contacting support 5+ times , the only result I have gotten is now the app doesnt work at all when I try to schedule a ride it just blanks out and does nothing. Unbelievable.",
        "I've had good experiences, but as of the last month, the app and website have been totally inaccessible to me? I get an error on the app and site every time I access them. There are momentary blips when I get access, but not long enough to schedule a ride. This is extremely frustrating. I have tried all the suggestions I could find from my research to fix the issue.",
        "My use Lyft on a regular basis and my issue is mainly with the route that you give the drivers! They are made to take unsafe routes when there are safer alternatives. Us that pay should be able to show our drivers alternate routes for safety and also time. I have been late only because of the route Lyft chose. LYFT PLEASE FIX YOUR ROUTES!",
        "It's like a cab service but more reliable 5 stars so far, excellent service every time (check the reviews of your driver)",
        "my driver was awesome his car was so clean and he had a great personality 🌅👋🏽👋🏽👋🏽💙",
        "Use to use this app all the time cause it WAY cheaper then Uber, but now 20 bucks or more for every ride no matter the distance. Are you out of mind?!?!? Uber has became way more affordable then Lyft and that's just sad. Even with your lame 10% off Uber beats you with the prices. Never using you again!",
        "Extremely Boujee company.. doesn't realize people are not white nor have the mentality of acting like they better than a demographic like some demographic of people",
        "Always there when I need you!",
        "Cost is crazy the city busy is more reliable and don't steal your money.",
        "Friendly, courteous service. Providing the rider with the name and license number for the car picking you up gives you peace of mind and an added security level. Highly recommended! Cheers!",
        "Today I ordered a ride from Uber but I saw that my driver and wait were switched then go over to the Lyft app and I find a cheaper ride option I book it. The driver loads quickly. I say thank God. Then as the driver was 2 mins away, he started getting further & further from my pickup destination. I called, texted multiple times no answer then after watching the car icon get further away. Finally lyft informs me it's finding me a new driver.Improve your driver selection or improve your nav system",
        "No comments yet...",
        "My ride is always a good experience drivers are very professional and helpful",
        "DO NOT PAY FOR PRICE LOCK PASSES! price lock is just a cash grab!! I paid $10 for my price lock passes used ONE of them ONCE and it only worked that one time! I know it Capps out at $40 but I did not save nearly that much on one ride! I tried to contact support but you can't it's all just dumb faq pages! plus it's kind of suspicious that I got these passes early in the month and all of a sudden end of the month I've \"reached the $40 savings cap\" save your money don't pay for the passes!",
        "It's a great app for transport to work and home",
        "Retired driver. I try not to drive at night I now need your services occasionally Paul",
        "No one picked me up this evening supposed to be here at 7:00 and I was outside waiting and waiting and waiting and I am not going to pay for this so actually you can take me off your app I will not use you again ‼️ Your pricing is way to high for me.I didn't know My insurance wouldn't pay for it or not ‼️I will call them today, I didn't have any money or transportation right now. But didn't know how to get back ahold of you ‼️",
        "Prices are ridiculous and your driver's keep canceling on me. I am stuck at work and irate about it. Poo on you.",
        "I need prices before putting my card # in",
        "I Clicked On 2 a Few of 9.99 But Was Charged A Different Fee on My Account Unscrupulous Practices!",
        "On time, clean vehicles, couteous drivers.",
        "safe ride",
        "Every time I have tried to use this app.There is a not enough drivers. There's always something. You know , for an app that claims for the conveniencedon't waste your",
        "Lyft is no longer an accurate app. You can't depend on the times provided to be remotely true. The drivers far too often will leave you waiting 30+ minutes before arriving, if at all far too often.",
        "This app is really convenient until one needs to try and contact a lyft representative. Left my phone in a lyft ride. Did not realize until that point that I have no other way to access my account. Phone was never returned. Going to look at other options, as this company has little interest in actually speaking to its customers.",
        "Heaven forbid you have a billing issue! They already got paid for their fare but they waited 3 days for some bizarre reason to charge the tip I keep my credit card locked due to ID theft. And now they are telling me that unless I pay the tip I can't use Lyft! From now on I will not leave a tip on the app I will tip the driver personally. I've had major issues with drivers that were also left unresolved.",
        "Always Overcharging! Never showing accurate availability. Constantly saying rides not available while showing cars on map, or not showing cars on map and saying rides available within 10 or 15 minutes.",
        "No complain excellent drivers",
        "I needed a ride scheduled for my son to get to school in the morning so I planned it out and scheduled a ride for him on Lyft and it said it was set up and a ride would be there in the morning that night. The next morning I woke up and had an alert saying a ride was ready and would be there so I left and thought my son would be fine. Then when the time came the app said there was no one available to pick him up and I was freaking out. Thought I was scheduled in but I would not rely on them again",
        "My wait time for driver kept getting extended. 9 mins, and then 6 mins later, 19 mins.",
        "They FORCE you to tip or app won't close and pay . You have to type in a minimum of.01 because they are just like the new BS of automatic tipping.",
        "Don't have a phone plan just data when travelling so can't use app. Very frustrating.",
        "Not now only because im out of work,with no i ncome to buy a good vechicle",
        "Very dependable and safe rides at all times.",
        "Y'all really r some money hungry hoes. Get a gift card, so y'all up the prices? Nice",
        "This has been a life saver !! Drivers are very friendly & quick to d eliver me!!",
        "45 bucks just for a ride to work, 8.2 miles, and my trips have no guarantee, Just for those thinking about using this app...... Btw that one way ! Not round trip! People should know this, before they store all your data, that won't be erased!!!! This should be all put out there too!! They don't tell you until you request the deletion!!!",
        "lyft app is not working, cannot log in to check of ride is on the way",
        "App is trash... trying to book a ride to work n this app is not working ughh guess I'll use UBER!!!",
        "App hasn't been working at all for a whole year.",
        "I like the app however it would be great if they could offer more than one allowed stop to be added to the trip in progress . New promo codes added to the app more offten and other than the refer a friend promo would be awsome ..",
        "Go with Uber, these guys are way to expensive!! 😔",
        "Able to recover lost downloads",
        "Very easy ride app to use, understand & navigate however their prices are much higher than Uber according to my research.",
        "Never picked me up and charged me and wouldn't give a refund. They just stole my money, and there's no customer support.",
        "great driver very clean car and has iPad in back seat for you!!!! thanks!!!!",
        "Cannot beat it with affordable means to travel in a private setting.",
        "Got a lyft that said 8 minutes away. 6 minutes later my ride is canceled and charged $7 cancellation fee. No ability to dispute charge. No ability to get a refund. 10 years riding with lyft. That was my last ride.",
        "ALWAYS,A GREAT RIDE WITH ,LYFT WINTER,SPRING, SUMMER ,OR FALL, LYFT ,LIFTS YOU THROUGH IT ALL !!!❤",
        "Terrible experience, customer service worse than useless. Huge waste of time",
        "Literal scammers. My ride was supposed to be $13, they took double the money from my bank account and their support says it's just \"a sudden price surge and normal\". I contacted my bank for a chargeback and they told me they constantly have customers using chargebacks on Lyft for this exact reason",
        "Lyft always takes the slowest longest route. Adds 5 minutes to a 15 minute ride and wastes your time and money.",
        "Personal Reminder: Make sure VPN is set to your location. 7.22.22: Cust Svc may be handled by teenagers. App didn't export ride history, or via Chrome browser for 9 wks of rides. (Several attempts) When explaining this, asked to send me the report (i was logged in), they replied with the process i'd already done. Duh! #noreadingcomprehension UPDATE: no cars avail on a sat 1130am -1210pm. PREVIOUSLY: app requires 2 credit cards on file, of which i do not possess. Had to use a taxi.",
        "I wish I could put a zero star on it the program itself is glitching never really bad even on the website and not only that my doctor itself had made the lift schedules for me to get there and made a scheduled time for the driver to come and hadn't got here for the past two times in a row due to the fact of the program itself refused to find a driver for me before my appointment has come by I am so uninstalling this app is the worst app I have ever to use the program itself is no good",
        "Another Great Experience !",
        "Was great to have as an alternative to Uber and the app worked fine. But it will not stop pestering me and there was no way to turn off the unwanted notifications. I open the app when I need a ride somewhere - randomly pestering me every few days is not going to make me need a ride... but it is going to make me uninstall the app. Uber only from here on out, cause they are there when I need them, and don't pester me the rest of the time.",
        "I would zero star this if I could. No customer Service support. I mean fn zero. Absolute BS app. Stole $100 of \"Lyft Cash\" and there's not a human I can call about it's return. Fn bs pos.",
        "Great 1",
        "I used to use Lyft a lot. As a disabled person it's a lifesaver. But now they want to charge over $20 to go somewhere a mile away. Uber charges under $10.",
        "Always good courteous drivers. All my vehicles are down save the day.",
        "Usually, this app is alright. Lately, though, the drivers keep canceling. Im not choosing the wait and save option. My advice is not to use this service if you need to get somewhere in a hurry. The app will regularly tell you that you will be picked up in 5 minutes only to take 20-30 minutes.",
        "On time smooth ride",
        "Staci was on time, clean vehicle, very polite and friendly.",
        "Scheduled a ride for 6:30am Garanteed a ride at that time. It's 6:36am NO RIDE. 17$ TO BE LATE FOR WORK!?",
        "Decent but flawed",
        "Why is this app so different? I have to uninstall it in order to install an update? It doesn't happen to any other app. Can you improve the installation of the app updates?",
        "Fast, respectful drivers and good prices when buying a ride!!!!",
        "Wow this was a horrible experience not even just once but multiple times. Not even slightly worth it at all",
        "Prices keep going up, support help is and less HELPFUL. I wish we had other options. Edit: prices keep going further up and discounts down. Not recommended unless you have no options.",
        "Another rider got onto my ride that I paid for & I attempted to let them know hey I'm sorry that's my ride and even ran after the car, which to no avail as they drove off. I called the driver MULTIPLE times and texted him & he would not answer, they drove TO MY HOME & drove longer as that wasn't their address, I never got a refund and there is NO option to report this other than to review the driver and ive gotten no response. The \"customer service\" line is ONLY gift cards, and nothing else.",
        "My Internet went out on phone and when I went back to app it said I cancelled my ride when I did not.. and the app charged me a 5 dollar cancelation fee the ride was 9 dollars I live very close to my job.. when I went back to the app the only rides available were 19 to 20 dollar rides.. customer service is trash they have no phone number and no real way to Resolve the issue.",
        "Can't login. Won't accept my email",
        "I will never use lyft again. I called twice to cancel a 3:50 pick up ride called to cancel once reche c ked and second call still showedNOT canceled and got charged $10 . Disgusting",
        "Allow riders to rate drivers who drop them after waiting for pickup.",
        "Do not trust lyft price lock pass! Terrible policy that they don't honor.",
        "LOOOOL can't even create a new account, it keeps saying enter email which was already done. What a POS.",
        "Excellent Service.",
        "It really sucks this specific rideshare seems to have a monopoly in my city and the app absolutely takes advantage of that: Plenty of drivers about and STILL charging surge prices, no matter the time, no matter the specific area. I blow so much a month here just to get to and from work and it's a vicious cycle.",
        "After reading the reviews  why would anyone install this?",
        "Every time I think it can't get worse, it does. Scheduled a ride that was already ridiculously high. I still accepted the ride that was supposed to get to me in 8 minutes. Then it connected me with a driver 14 minutes away. I was still cool with that. Then after waiting five minutes, that driver canceled on me connecting with a driver 20 minutes away. Where waiting 15 minutes can save you money so I canceled and tried to get a closer ride and now rides are twice the price. Scammers",
        "Doesn't allow me to scan my payment/card with camera. Fix it",
        "This company has 0 customer support. I've been overcharged roughly $100 for a ride, and they won't let me open a ticket and have 0 customer support at all. If you have any other option to get a ride go with that. This company is scummy and will not help you if you have any issues.",
        "Charged double the quoted fare and cant talk to anyone.",
        "Honestly for times I've used this app it was good until with the fee and charges for cancelation on the rides, I had order a ride yesterday for 24$ and when I saw I wasn't going to make it on time for work I cancel the ride and walked it due to a 40 min wait. Till then they guaranteed a 22.47$ refund, and when I went to check my statements, I was only refunded 8-9$. Honestly I wouldn't recommend the app if you want your money taken up for a ride that didn't pick you up.",
        "Can't add custom tip, only preset options will activate Add tip button. Oh wells",
        "Lyft! stop forcing riders to pay additional tips to drivers that don't deserve it. If you're concern about their satisfaction with your labor practices, pay them more!",
        "Don't use Lyft. A driver who refuses to speak English wouldn't let me out of the car. Customer service only refunded the ride and gave a $5 coupon. Wouldn't cover 2 additional trips I'd have to take because of their driver's mistake.",
        "Great driving, friendly driver!",
        "Karina did a great job.",
        "Very inaccurate eta (not fault of drivers)",
        "If I could give it 0 stars I would. Their customer service is horrible. Lost a valuable item worth over 400 and the lack of communication was upsetting. Never using their services again.",
        "Priority pickups always take 3 times as long as regular ride, no in app customer service, better of with a cab",
        "Need # character for gate code share",
        "Does not have a direct contact information.",
        "Good",
        "I was physically assaulted by a lyft driver. She refused to give me a ride, canceled the request on her driver app, kicked me out of her car, then attacked me with her fists. I know the driver's name, car type, and license plate #. Since she canceled the ride I have no way to report her on the app as there is no record of the request. A police report has been filed. I need someone from lyft to contact me ASAP."
    ],
    "com.grabtaxi.passenger": [
        "good",
        "Good",
        "Gimana sih kok ga bisa terus bayar grab food pake cash",
        "thank",
        "Customer service sucks",
        "Helpless center",
        "Driver banyak sekali yang Tidak RAMAH. Selalu mengajak ngobrol Dan sangat Tidak NYAMAN. Serta untuk pengiriman, sering sekali driver menunda.",
        "prompt service and polite.",
        "awesome",
        "Update october 28 2024 Bukod tanging apps na toh ang nagpapasakit ng ulo ang daming ko apps bank account local and international/paypal pero sa bulok na apps na toh talagang bukod tanging hindi lang ata 20x ako nag register sa bulok nyong apps basurang literal hindi ko maintindihan kung anong uri ng A. I ang ginamit nyo para mag verified ng pasado sa KYC 20X din akong nireject HINDI NAMAN PASSPORT YANG INAAPLYAN KO PALITAN NYO YANG MGA BOBO NYONG KYC VALIDATOR DAHIL UBOD NG TNGA 🚮🚮🚮🚮🚮🚮🚮🚮",
        "Ayusin nyo naman yung pag zoom in ng MAP nyo pag nag book.... hirap i navigate, hirap iZOOM IN!!!",
        "Excellent service",
        "kulim p Butterworth rm 80 buto dia",
        "Always good",
        "How many times i fill up to verify my application and it always reject. I have balance in my grab wallet and i can't transfer to another wallet because need to verify my account, paulit ulit na ako nag fill up wala padn. Wala kang kwenta 😡😡😡",
        "payment method no option to pay via gcash. this app still on beta I think 🤣",
        "Good",
        "Very good experience using Grab. my first time with so much good memories to retain. Driver was very helpful to load and unload my luggages.",
        "omg! Why does the driver keep canceling me",
        "No top up possible with foreign credit card anymore! Next you cannot use the app at all, if you're not a local. Very disappointing development. App is OK, sometimes cluttered, sometimes lagging, but overall doing its job. Service has improved, but it depends on the country or even town. For example Malaysia is usually good, but in the Philippines and Indonesia they're already hand in hand with the taxi mafia with exorbitant pricing.",
        "very fast receive the changee. tq so much to the driver.",
        "ok",
        "Top up was successful but mistakely forgot to verify. I lost my money on way to Grab wallet. Losing money is not big deal but Lost couple of hours try to retrieve it but hopelessly lost my money.there is no way to retrieve your money if u do that same mistake as me.from now on i am going to uninstalling \"Grab\" and never use it again.",
        "nice apps",
        "he is fun and good driver.",
        "Perlu ada rincian transaksi per bulan dan dikirim summary pengeluaran makan, transport, belanja, dll supaya konsumen bisa track pengeluaran per bulan. Contoh gojek tiap bulan kirim rincian pengeluaran ke email.",
        "I like grab service.",
        "everyday I buy food your shop but today I am disappointed your rice because your rice very soft smell I am so many time I am call your no answering my call please next time not send food check your foot please",
        "Hi, just wanted to file a concern, just now, The driver didnt wait for 5 mins let alone go to the pick up point but when he cancelled it, my girlfriend's account got deducted with 50 pesos. His name is Zaldy Ortega Dela Cerna Jr. Riding a maroon toyota vios plated NFC5509",
        "good",
        "good driver",
        "nice car n nice driver",
        "Horrible. I need a refund. You charged me for a booking that wasnt even completed in the first place. This is the third time it happened!!",
        "Prompt, clean cab. Excellent driver",
        "fast delivery🤍",
        "Customer Friendly.",
        "Drivers are now not picking up passengers. Very hard to report to grab now and they have deleted the means to talk to a customer support. Bot is useless and support is saying to contact them on official channels, guess what, those channels are handled by bots too! Too bad I don't have any choice.",
        "good service",
        "good driver.nice service. well mannered.5star.",
        "I don't trust this app's security, especially regarding what information the delivery food riders obtain concerning their users. Although these delivery men/women are more professional than other food delivery providers I know, there are times where it feels like they are spreading information amongst each other about the user. Finally, I don't appreciate how this app uses personalization to determine what restaurant or grocery mart to recommend. But I know you can't fix this, so don't bother.",
        "Teruk masa kita nk sign up tu sangat lambat dia orang hantar code",
        "good experience grab car and grab food❤️❤️❤️🙏🙏",
        "How dare you make me watch unskippable ads when I book a car?? I pay to use your services, and I still have to suffer through advertising? Unacceptable.",
        "easy to used",
        "No customer service to assist my overly delayed complaint",
        "good",
        "E? E? ER? E? Red? E? A? E? W? E? E my? R? E e? E?? E? E e? E EE",
        "Bagus sekali",
        "live chat nya kurang membantu dan responnya lama bgt. jawaban dari cs nya ga memuaskan",
        "I only use this app when in the late situations anyway. But it's so quick! Just one tap ordering the driver came up to me with the great services, and offers.",
        "Such a bad app no support function /chatbot/live agent to help with sign up process",
        "perfect👌🏻",
        "It's very convenient here in Manila. Great experience to use the Grab app.",
        "The system is becoming slow.",
        "10x better than typical taxi",
        "U call your country secure and these guy's disrespect your own country in front of us still u employee them superb man don't even know how to treat ur own country and show off sorry but abusing the woman and outsiders doesn't make ur singapore better grow up grab drivers respect outsiders and first respect ur own people Not just blabbering the review if u have any concern check my booking I'd below A-7WEIQN3WWHCW Out of 10 rides 9 rides were good but this one above ride shows how low and worse u",
        "Countless of instances where my order gets delayed then canceled caus there's no driver available. Very frustrating. Plus, there's no customer support to contact or nothing. Fix ur policies",
        "Driver's English was very good and also very friendly, I would certainly use him again.",
        "The driver marked my food as delivered, although it was not. Getting a refund of Grab was troublesome, so I stopped trying. I recommend beFood in Vietnam.",
        "good",
        "Good",
        "very helpful",
        "This is so empress me im away from home but i still have time to make them happy by sending food by this App im. so much fun wth it.. tbank you",
        "I've been waiting for an update of my issue and it's been near 2 days and no update.",
        "Trade",
        "I have 2 phones, I want to use the same grab account on my both phones. Food panda can, why grab cannot. I have food panda app on both of my phones and my tablets. Please don't tell me it's for safety that's why only can use on one phone. AND Why still no dark mode....why? DARK MODE",
        "excellent service",
        "nice",
        "❤",
        "Grab-Soesan -HtikeTaxi7:50",
        "Due to map limitations, we have to pin the nearest location and specify the exact drop-off address in the \"Notes.\" Unfortunately, many Grab Riders and Bikers don't read these notes, leading to frustration and delays in deliveries. What worst happened was that it ruined cake and wasted time. It’s important to ensure they check the \"Notes\" before making deliveries. Had to put 1 star hoping it gets your attention.",
        "Easy booking, superfast cab assignment and amazing prices.",
        "okok",
        "Good",
        "They put ads when you book a ride. UTOL is much recommended",
        "MotoDriver Mostly impolite... Arrogant & Agressive & keroyokan kalo konflik.",
        "Customer service for Grab food have declined. Days to weeks without any response or resolution. Customers are basically screwed if we face problems with our orders.",
        "Itu restoran udh tutup tapi masih terima order, ini mw nunggu 50 menit baru auto cancel kan gimana ya. Ini flaw design ini",
        "Wallet is not working in Myanmar",
        "👍",
        "It's annoying that you cannot details of delivery such as time and address after making an order. Esp time of delivery cause it shouldn't effect your order since the restaurant or even mart haven't make your order. It makes me want to stop using grab just because of this.",
        "very nice",
        "Laggy application:(",
        "Good Transport application",
        "Hi! It's very easy n comfortable services frm Grab...bravo. if the delivery personal has E- WALLET options for payment purposes....it would b much more better for us when out of cash. Thank u",
        "Not good rubbish sh💩..grab not for foreigners rubbish driver's not safe!!!!!!!! Scams driver's!!!!!",
        "clean car an nice driver",
        "because of advance deduction and late reversal via gcash, i need to pay in cash due to low balance. i suggest that the deduction will be after the pickup. upon booking, it should be balance inquiry and not advance deduction.",
        "Corny lagi wala rider pag cash payment",
        "It's Good",
        "fast, no hassle delivery",
        "Way too many \"delivery\" notifications. It will tell you your food is arriving like 8 times when still 7 mins away.",
        "Your social media channels are not helpful as well. Poor service now. ------ Customer service and response are not guaranteed in times of need. More of AI features and automation. Customer cannot get the right response. Its a waste of time.",
        "ANYONE ELSE NOTICE GAMBLING ADS ALL OVER THIS APP? While the app is convenient for food orders for me, I don't appreciate the gambling ads. I don't even gamble nor had an interest to do so. I am not sure why you also allow that in your platform. It's not even related to the services you offer.",
        "Recent changed on my housing map, displayed wrong name of road and gps pin location, i couldn't find way to correct it, possible for grab use google map? your own map so much issues !!",
        "good service",
        "He is helpful.",
        "Deleted. Spyware Apps self update regularly without any setting option available nor asking approval. Even blocking its wifi and cell data access is not possible to block this Predatory bad Apps.",
        "Suck",
        "This version has problem with grab wallet. I transferred money to top-up 500 baht and firstly the app show as processing transaction and the status just disappear later! But my money already transfered to grab as the money is already deducted from my bank account with a receipt from banking app!!!",
        "good",
        "Know fs www etklrstthhekl No 😴 edk",
        "love this grab app",
        "good",
        "Please refund my money",
        "Uamg sy belum direfund sama Grab sampai skrg",
        "CAMBODIA: Stop the auto accept feature for drivers. I have to cancel so many times due to inactive drivers not coming to pick me up. With that said, it warns me that I will be penalised for cancelling and I will get closer drivers if I cancel less. So, you are penalising customers because of IDIOT drivers who accept whilst they are sleeping. This is not good when someone wants to get to work. Stop the auto accept feature. Stop it ASAP",
        "but it's hard to get a driver from my resort",
        "perfect",
        "very satisfied",
        "What's the purpose of having Help Centre chats only if to chat with undertrained Bots",
        "best",
        "Punctually is excellent 2",
        "It appears that Grab CS was completely outsourced to AI recently. Was able to speak to live agent earlier this year, but wasn't able to get any live agent. No response for a full week and counting even after emailing support to report issue.",
        "first time ordering at it was good not much experience yet",
        "nice service",
        "Delayed transferring money to gcash. I transfer money in October 26, 2024. Until now, I did not received the transfer money to my gcash.",
        "bersih dan segar..sangat perpuas hati..tq",
        "good",
        "drivernya sabar",
        "Grab no longer accepts my foreign card, so now I have to switch to something else.",
        "This app is easy to use. The only drawback is that its services are a bit overpriced. Also, please stop with your advertisements. I am starting to get annoyed.",
        "Please update the maps section, other apps have updated maps of the area where I live, but Grab has not, poor drivers like to get lost and have to make a U-turn. Thank you",
        "can't place my order at the right time because the app suddenly needs to be updated. WASTED MY TIME😡",
        "really good app",
        "good",
        "good driver and good driving",
        "Very like fast delivery",
        "Hello Mr.Grab...more power.",
        "thanks on time",
        "pleasant pretty",
        "Horrible app experience",
        "Worst customer service.",
        "good drive safe",
        "No live agent to chat with. Ordered and my order and driver never arrived. Was still charged for that order. Driver can no longer be contacted. Poor app support. Still no response or refund after 2 weeks. Terrible service",
        "thank you sir 😊",
        "First Grab ride ever and it was a great experience.",
        "Metode pembayaran mu payah grab, ovo error terus, scan nya gak bisa payahh, tiap scan pake ovo dari grab error error, benerin lah sana",
        "amazing service",
        "Ngasih alamat sama arah yang salah padahal udah sesuai sama lokasi",
        "Good services",
        "verry good",
        "Great service 🙏💖",
        "wow",
        "ok",
        "Lazy people working in the office. Useless customer service help centre. Food missing. Requested help for 2 weeks but not even 1 person reached out to me. Big company, useless staff.",
        "Since a few days ago, Im having a hard time booking with grab(Car, Taxi, or Savers). I need to sit for an hour on average to get someone even if its not prak hours. I once asked the driver if they're busy and he responded,No Sir, nakatambay lang kami waiting for booking. Frustrating",
        "terbaik",
        "Esmail",
        "bet",
        "Rides are crazy expensive now (3x normal taxi prices) and unreasonable. Also drivers are greedy, rude and cancel on you after making you wait for long time",
        "good",
        "please offer what customers required, if they are 6seats, not 4seats taxi select customers",
        "Try Grab nice and safe.",
        "but its hard to cash out",
        "nice",
        "Customer Service is trash. I filed a total of four tickets since Sept 13 and not a single agent has responded. I've been following up ever since. I'm not able to use my cards bec of a pending balance that was successfully deducted from my bank account. My bank already confirmed that the transaction was successful.",
        "Good to deal with like Grab for food and TAXIS",
        "taas daku gahi..",
        "This is related to the Food and Drink (I don't book a Grab car that much). You can't cancel the order after 30 minutes or more, which sucks. And getting a driver to get and deliver is getting harder. Why is it more longer to wait if the mode of payment is cash? I have been waiting for almost 2 hours and my order just got cancelled because one of the items I ordered was not available. I had to book again and wait for how long. This is difficult for someone who only has cash as payment :(",
        "use Gojek instead of this suck app..",
        "1. If bussiness user should make it default payment or at least remember previous choice 2. When listening to music via bluetooth and grab call is coming, music will be paused (good) but if take the call, music will be resumed (super bad) 3. Should target voucher/coupin by user. It's non sense when you push/show pop up a coupon all the time when user couldn't use it 4. Should support Google Wallet/Pay",
        "My order was placed 30 minutes ago. But it hasn't even started being cooked yet. However grab is so money hungry they won't allow me to cancel it, and I can't get in touch with customer service, because of course they don't spend enough on that either so there's no one to talk to. Ordering food from this app is a lottery. You might get your food, or you can spend 40 minutes trying to cancel your order because nothing is happening.",
        "Pesan grab food lewat pickup. Di apps sudah siap diambil. Pas sampai, malah belum dibuat pesanannya",
        "byk sgt kali kena k3ncing. makanan tak cukup. lambat dsb. ckp byk nanti cs reply bagai..",
        "Delivery is too slow and I can't even cancel my order",
        "Uang parkir grab food itu lebih baik ditaro di tagihan aja. Biar ga rancu, kewajiban membayar uang parkir itu sebenernya oleh konsumen atau driver",
        "Tệ. Vừa bấm thấy thiếu món muốn hủy đơn liền ko đc, thêm món cũng ko được, nhờ bác tài mua thêm trả thêm tiền cũng ko đc, đặt thêm 1 đơn cũng ko được mặc dù thanh toán trước.",
        "Palaging kinakancel yung mga order and palaging cancel yung booking",
        "Initially it was good however, these past few week, i fact 9/10 of my orders were delivered extremely late. A week ago, prioir to Typhoon Kristine, I order a medium sized meal to a restaurant near my area, I was sick and couldn't move out of bed. My order was placed midafternoon, the weather was fine, the traffic wasn't heavy, and it wasn't a busy time for diners as it was not a peak hour. howver my delivery kept on being pushed back, until I have no choice but to go out. then it came 3hrs late",
        "👍👍👍",
        "Harganya sangat mahal 😰🤯😰🤯kota Makassar??? Tidak ada promo??👎👎👎",
        "Always delayed and no available Rider. You can't cancel order hope this will fix ASAP.",
        "Nice",
        "2nd time add on Pearl but no pearl",
        "Really satisfied 😊❤️",
        "very good driver.",
        "super bait na driver",
        "helpful app",
        "Excellent driver",
        "The map of destination arrival doesn't show including the price tag of the distance. the last time I booked,10km from my house to my school was charged for $2.5,but for 4km, the driver charged me for 5$.",
        "thanku so much",
        "Good Service",
        "Uninstalled app after 2 terrible bookings today. They charged me for no-show even if it was less than 5mins that the driver waited because I, with 3 kids in tow, took so much time to cross the busy street because the driver would not care to turn to our side of the street. Then they charged me for canceling a booking after 5mins because the driver asked us wait while he was just nearby and i already flagged down a taxi. Kudos to you! You've found a way to make more money from app users!",
        "The service is very good and driver is very humble and driver pick up very fast and send the destination right time. Thanks you..",
        "Never a pleasant experience using Grab. Waiting times are almost always tripled. Prices are tripled while the service never improves. Terrible",
        "Good",
        "The grab service is getting worst for both food and transportation. The customer service is so bad. The drive can easily manipulate the system and cancel on you and you be charge for no show, when i have been waiting here with no sign of the driver car, no contact from driver. Suddenly showed arrive but the car in the map show different location and i was charged for no show. That not all, I can't get a refund. Make a report had wait a long time. I'm uninstalling",
        "ငါဗိုက်ဆာနေပြီ Promo တခုခုပေးပါဦးဟ",
        "Very nice app",
        "top my my wallet but the transaction didn't reflect in the system, and my bank acct deducted",
        "ok",
        "Server ကျနေတာလား၊ဘာလားဟ။ တချက်လုပ်စမ်းပါအုန်းဟ။ 4 လ 5 လရှိနေပြီ။ ဘာ$လုပ်မှမလုပ်ကြဘူးလား။ မင်းတို့ဘက်ကလူတွေက",
        "good",
        "often offer fake discount. always putting discount 1 hour ahead. but after 1 hour, the discount is shifted to another 1 hour ahead. shame on you giving dirty marketing strategy.",
        "Bro when tf am i supposed to get my food?? The app said 30 mins. and its been an hr now :)) fu",
        "good service",
        "Grab express 30 minutes and 60 minutes still not reach. Customer service is very poor when it's grab fault and not able to cancel.",
        "very courteous driver. good",
        "Bruh they charge me late fee because driver was helping me to load wheel chair."
    ],
    "com.cabify.rider": [
        "Bad Service. Cabify don't train their drivers to give a good servrce., they don't even know how to drive. Not recommended.",
        "I used cabify at Alicante airport which and gave driver exact location to meet us at Arrivals. We watched him driving around on the lower concourses to charge us extra. Use the local taxis, they are cheaper and you don't get any tricks.",
        "Pueden actualizar la app para poder cambiar a modo oscuro?",
        "Not an app but a disaster. Couldn't pay, could register ID, couldn't use the service. Suport wasn't helpful and the help button didn't even work properly.",
        "I am in Spaine and would like to register. \"Please select a number\", no problem Ukraine number selected... \"we can not send sms to this number.\" Ok, let me select Spanish number (it is less convenient for me, but what to do). => \"we sent you a WhatsApp message.\" I have NO WhatsApp on Spanish number. Didn't even start to use the application. Minus one potential user for you. More stupid can be only to lock aplication for Spanish region only.",
        "Horrible app. It cannot even register me with that Whatsapp not even coming. In 2024y they cannot even make registration right.",
        "customer service is fast but the app is terrible. had my journey cancelled 6 times.",
        "Could not send an sms to foreign number, cannot use the app",
        "Normally, I use Uber, which only gets expensive on the summer season due to the busy schedule, but sometimes I have to use other services such as bolt and cabify. It's very expensive whenever I want to use the service. Apart from that, the rest is the same as Uber.",
        "Had no way of accessing the app, either way via Google or sim",
        "cab booking was accepted... waited... waited.... waited..... waited.... gave up, and deleted the app.....",
        "Tenía una reserva a las 5.50 desde varios días atrás y no se ha presentado ningún conductor. Lo más importante de esta funcionalidad es que sea fiable y que haya un conductor a la hora estipulada. He tenido que ir corriendo a coger un Zity que había 1 km de milagro y he podido llegar al tren de Atocha de las 6:40. Esta funcionalidad no debería fallar nunca. No volveré a usar Cabify mientras haya una alternativa disponible, se ha convertido en mi última preferencia.",
        "It says that it cannot send a message to my Bosnian number, therefore, the application is unusable for me, even though I am currently a tourist in Spain, but I do not have a Spanish phone number.",
        "The final price is always higher than the original quoted price. Scam.",
        "Only for locals",
        "Can't even use or log in don't waste your time downloading. IMO freenow,uber are better options.",
        "Cabify directed my driver to the wrong location, forcing me to walk 8 minutes to find him! The address on Google Maps was correct, but their app had it wrong. I was then charged extra for the wait time, and when I complained, customer support refused to refund me, claiming the driver waited 10 minutes. This service is a joke! *** Response: Obviously I tried to contact customer service but they were useless - didn't even bother verifying if the pickup address was correct!",
        "The app works, it can be improved, but the amount of notifications is disgusting, I had to disable all of them to stop the uninvited non-stop annoyance.",
        "No logro poder usarla en mi zona, desde que regresé a Argentina básicamente la tengo en desuso porque nunca me asignan un chofer.",
        "Doesn't seem to be able to register international mobile numbers",
        "No indica el tiempo de viaje estimado. Pésima interfaz y poco descriptiva para hacer pagar al usuario.",
        "you better dont forget anything on the car cause they will never find it and the process to contact the driver is tedious. Im uninstalling the app.",
        "No te permite elegir el viaje y después te lo cobra igual sin consentimiento.",
        "I can't even register an account. I installed the app a week ago. It has continued to say it cannot send the SMS to WhatsApp for me to receive a verification code. There is no way past this to even access the app. I emailed support a week ago and have had no response whatsoever. Adding to the many recent bad reviews is the only option I have left.",
        "Great, l've tried down loading the Uber app, with no success. The cabify app was so simply that l am only going to use cabify. All you really have to do \"is follow instructions\". Take your time, read how and what to do. Simple. The price was also the cheapest. Great drivers, that know Madrid. There is no other better service for a cab to take you where you need to go. My hat is off to your company.",
        "The Marocan driver was playing stupid. He said he must follow the navigation even if I told him on time that his navigation is not showing the right way and he needs to turn right to enter the city. Navigation was guiding him in circles from one roundabout to another. He refused to listen to me, and instead of paying 55e, I paid 86e. In the end, I had to be rude and start yelling so he would listen... otherwise, we would still be driving in circles...",
        "not in service area but forces you to register and create an account and give them permissions when they don't even service area",
        "Siempre te cancelan los viajes, y si no te aceptan y nunca te recogen, y cómo la app nunca penaliza este tipo de comportamiento siempre seguirá ocurriendo",
        "The app and service is very poor. The app frequently has cache issues, constantly needing to refresh, and is awful at estimating pickup times. It also permits drivers to ask people to cancel rides and pay in cash trying to defraud people, and the report feature appears to do nothing.",
        "Cada vez más horrible funciona, y para colmo te cobran ANTES SIQUIERA de que alguien te acepte el viaje... Y sí te aceptan, te cobran más de lo que figuraba y encima te cancelan el viaje y no te devuelven el dinero.",
        "You can not make an account if you have a number from another country",
        "La aplicación es decente y los conductores son en general los mismos de otras apps PERO ya varias veces me han modificado la tarifa en lo poco que llevo usando cabify, argumentan que hubieron cambios en el itinerario pero eso nunca pasó. Otra cosa que pasa es que los conductores a veces no marcan inicio o fin y eso genera cobros extra por los que he tenido que reclamar en esta y otras apps, podrían implementar alguna forma de verificar eso por parte del pasajero también (tienen nuestra ubicación",
        "Can't even start this app, I keep getting an error saying it can not send me the SMS during the process of registering. Update: I received an answer (which I can not see here) to post my issue in the help community, but I can not even register to do that.",
        "What's the point of asking for the country prefix if you can't send an SMS to another phone number than Spanish. If you're a tourist you can't use it. Edit: I opened a case and they claim if the SMS is not send, I will get it through WhatsApp. I's been aprox one ween and tried multiple times and I haven't got it yet :) dear reader just imagine how ridiculous this is in 2024. Have a great day and good luck!",
        "No service in playas de Rosarito Baja Ca.Mexico?",
        "How to sign up at all",
        "Always have to wait ages these days. Searching for 20 minutes then wait, and I live in a big city.",
        "Very complicated to go throught registation while you want a car immediately",
        "Charged me for a taxi cancellation even though the driver wasn't at the pick-up point. Very cool.",
        "Good expirience",
        "Los conductores no aceptan tarifas planas. Que agarren la pala, si no que guarden el auto",
        "This app is riddled with bugs! Be cautious—Cabify may charge you for double bookings caused by these glitches and they are useless when contacting client service. Uber is much more reliable in comparison.",
        "The app charged me twice for the same ride",
        "Es costumbre que los taxis acepten el servicio pero sigan de largo alejándose del punto de recogida lo que hace perder tiempo al usuario.",
        "Signing up is freacking pain. Geeeezzzz. Nothing work. YOU must have whatsapp up running and don't miss the first time code. else, it will not work. The most horrific app to sign up with by far.",
        "La app funciona como las demás, el servicio de la empresa es malo. Te estafan, te cobran lo que se les da la gana, te cancelan el viaje y lo pagas vos. Pésimo. Usen cualquier otra antes que esta app.",
        "Basura de aplicación",
        "why in the world im going to make a reservation that is going to be canceled minutes before and then pay extra for the new reservation? do i have to pay extra to arrive late to my appointments?",
        "I saw a few very good drivers on this app but, unfortunately, it's extremely unreliable. Last time I've ordered a cab it took more than half an hour to arrive. Reservation costs way more (twice the price sometimes). Also has some annoying poorly impremented things on the app like you try to create a reservation for 45 minutes from now and it let's you choose everything just to tell you in the end that you can't make a reservation for less than 1 hour before! Why didn't you tell me that before!?",
        "No deja crear cuentas nuevas con números que no son hispanoamericanos. Con números de otros países europeos (como Alemania, Reino Unido, Rusia, Estonia, Turquía, Italia, etcétera) nunca llegan los SMS",
        "Utd an App on ly for locals, tried installing it from Malta but doesn't allow it when you put your phone number.",
        "only spanish numbers are allowed for otp",
        "Our friend has been using this whilst in benidorm, so much cheaper and reliable xx",
        "Stupid app, does not let you say how many people in the taxi, doh! Also abuses notifications for advertising",
        "Only usable by people with a Spanish phone number. Not even another EU phone accepted.",
        "Can't verify number, they only use whatsapp for that, no sms options. There is an option were they ask for your gmail password.",
        "They seem to hate money... I couldn't login using user & password during my trip because my SIM is different from last time. Google login doesn't work. I wanted to use your service but you just wouldn't let me.",
        "They would rip you off for higher chstges and they won't even let you know and they have very bad service and low amount of drivers just avoid it",
        "This app is just doesn't work. Can't register because it doesn't accept European phone number and/or any other ways like email.",
        "Entré presione el botón de comenzar y no halló ningún conductor, desintale y me doy con la sorpresa que me cobraron 8 soles y ni siquiera me subí a la móvil, exijo mi devolución.",
        "literally doesn't even work enough to create an account, PATHETIC",
        "very strange that cars hasn't markers or special green light. but! n' it's important: 1. never had problem with payment; 2. cheeper than, do you know who; 3. never had answered \"we didn't find a driver\"; 4. drivers never arrived with 5-6€ already - you paid through the app and that'll",
        "You can't use the app without WhatsApp.",
        "Pésimos conductores.",
        "Por lejos la app donde te cancelan más viajes, una pérdida de tiempo",
        "Nunca llega el SMS para migrar a la nueva app.",
        "No se que es",
        "Cuando más le necesite me fallo. Termine pagando un taxi que me salio demasiado caro. No la recomiendo.",
        "Do not download! We got scammed booking a taxi from Barcelona Raval to the airport. The driver made an additional 15euros charge through the app on our credit card, after he dropped us off, in excuse that we were late on the appointment. We sent the receipts to customer support, but they won't help us. It seems like a usual scam for tourists flying out from Barcelona. Delete this scam app.",
        "Ordered within 4 days 9 times in different areas of Lima, Perú. Not a single time the car has came. Either kept searching endless for the drivers or the drivers kept cancelling. At the same time Uber drivers always arrived no problem.",
        "The app works fine, this is more of a review for the service. You can't let drivers accept a request when they are 20 minutes away. This is just ridiculous. And it's getting more and more difficult to find a ride even in a place like Barcelona",
        "Cabify is a navigation app with a GPS system that always gets my home address wrong. Even if I type it in. The support staff are rude and unhelpful. The developers won't help either. They suggest I fix the issue myself instead of actually fixing their app. I don't recommend this app. I've switched to Uber. At least they don't treat their clients this badly.",
        "Muy buena y todo pero cuando más lo necesitas nunca hay nadie jajaja",
        "if they were as quick to get you a cab as they are to charge you when cancelling after waiting 3x as expected..",
        "What a trash... cannot even use it \"could not send sms\"",
        "Does not sent SMS during verification, useless app",
        "Toman las rutas que les da la gana, todo por cobrar el maximo límite o costo que aparece. Sacan excusas para todo, es que el GPS no funciona, no muestra notificaciones. Es la única aplicación que no da un precio definido desde el inicio. No responden mensajes, sus conductores son groseros y no les interesa prestar un buen servicio. Al fin y al cabo siguen siendo taxistas pero con algo de tecnología implementada, es decir no cambia mucho el servicio a sacar la mano en la calle.",
        "Rubbish!",
        "It always costs the maximum of the price range, the promised discount never helps. The accepted offer price can change by 25% and more neven though no any extra changes in the route happened. I'll uninstall and never use it again!",
        "My first order was deleted. At the moment when the driver arrived. I got in the car and had to leave immediately, because the app changed my driver. The second driver marked me that couldn't find me while I have been standing at the same corner for about 15 minutes at this point. At this point I was starting to be very nervious. In Bogotá, Colombia this is not the best feeling. Finally with the third drive I got to the hotel. I don't understand what the hack happened.",
        "Always too expensive",
        "Does not work",
        "After updating this week, the app is so buggy that it took me half an hour to input my destination and my home address (already saved) wouldn't load. The driver took more than twice the time they said it would take, the price more than doubled because after all the struggle, it wanted me to go to a different district. So exasperating!!",
        "Stay away from this service. I made the mistake of testing this app instead of known services like uber and they charged me money without providing a car. Scam",
        "\"we couldn't send sms\" country code Austria",
        "Can't even get a verification message sent to me to set up an account",
        "Hay ciertos trabajadores que TERGIVERSAN la información y la modifican a su conveniencia con tal de salir ganando, definitivamente NO RECOMENDADO.",
        "Very professional",
        "estimados, dejé mi celular esta mañana en un cabi, estoy intentando contactarmecon el conductor y la página no lo permite. Por favor, su nombre esonductor Carlos Luis Cabify, Fiat Palio AB512NO Le pido que URGENTE se comunique conmigo, recompensaré devolución, saludos Tarifas",
        "Ya me acordé porque la había desinstalado, nunca hay conductores",
        "Buggy app, way worse than Uber. Do not recommend. Time estimates are highly inaccurate. Do not use if you are pressed on time. Vehicle requested differs from actual that shows up. If you attempt to cancel because the search for driver takes forever, the app shows cancel but driver still shows up and you will be charged for it. Customer support is in denial. They will suspend your account rather than acknowledge the app is buggy. Before use, please read the reviews.",
        "Your app wanted to charge me 70€ for a 1km ride from Hostal Oregar to Santiago EA. Son locos? Or it's just a special price for tourists?",
        "La aplicación busca conductores eternamente, no sirve de nada cuando tienes prisa",
        "Esta aplicacion tiene Muchos errores de ubicacion !!!!...",
        "Es, con diferencia, la app tipo uber con mas tiempo de espera en la ciudad de buenos aires",
        "It locks any card payments that me and my friends tried so we could only pay cash :( it is more affordable than Uber though but we ended up using Uber more because Uber let us pay with card without issues",
        "Can't even install the app if you're not using a Spanish number. Why even make this available outside the Spanish market if you can't operate there? Look at all the 1 star reviews. They can't all be wrong. Whoever is leading over at Cabify HQ might need to wake up.",
        "Lo he descargado por una urgencia y resulta que por \"normativa local\" no pueden ofrecerme un servicio hasta más de 700 minutos después de registrarme por ser mi primera vez. Es una locura.",
        "De todas las app de viajes, es la mas cara. Además, nunca hay conductores y tengo que esperar alrededor de 15 minutos cuando yo uso estas apps porque estoy apurada y necesito llegar rápido a un lugar.",
        "does not accept uk phone number",
        "\"wE cOuLd NoT sEnD tHe SmS\"",
        "Keeping saying: we can not send the SMS!! Useless app!",
        "La app está muy buena pero hay un bug. Se cuelga la app cuando se quiere cambiar la foto de perfil eligiendo una foto de la galería. Moto g84 Android 14",
        "Not able to create account because if message is not sent",
        "App doesn't send access code. Useless.",
        "I cannot begin to explain how bad this app is. If you are used to uber or Lyft by no means expect similar service. 7 times we tried to use this app. In all cases it said 4-6 minutes which was more than 10 minutes wrong each time. The only time a driver showed up he had no route on his phone and neither did we so he just dropped me off. Another ride said 4 minutes, after 11 minutes we had a message to walk 5 minutes to meet the driver as he wasn't coming to us. This service is AWFUL",
        "It is a terrible app. It does not work properly, and according to my experience, the service they provide is awful. I do not recommend this app at all. The worst of all is that the help service is a bot that does not work, making impossible to receive help or support.",
        "Kept getting errors and couldn't sign up.",
        "The support chat system don't work. I rent a motorbike and the helmet box was not possible and return the bike. No support was avilable.",
        "If you're foreign, you can't make an account. Disgraceful.",
        "It's not easy to delete my account",
        "Usé la aplicación durante algunas semanas y varias veces tuve un problema con el conductor, además de ser maleducado, cuando tuve un problema con el GPS, Cabify me cobró doble por un viaje que no se realizó. No cuenten con su apoyo, es terrible.",
        "cabify > uber",
        "La app y el servicio es excelente, la nueva característica de especificar paradas es genial!",
        "Very difficult to install; the app at first would not provide the reqd 2fa, then it never really managed to switch to English - it just presented a blank screen with one selected button but nothing else. Not Ready for Prime Time. Uber worked without a hitch.",
        "My experience with Cabify has been very unsatisfactory. The app shows a suggested price that often turns out to be almost double when it comes time to pay. This pricing abuse is misleading and unfair, severely impacting trust in the service. The lack of transparency in the final charge makes it difficult to recommend this app to others. I hope they take action to address this issue and improve billing clarity.",
        "Doesn't allow to get past login page",
        "Lleno de apps, empeoró mucho la experiencia de usuario, tarda mucho en encontrar conductor y ya no saben cómo facturar que te quieren cobrar \"acelerar\" la búsqueda. Un bajón.",
        "Cant log in! Keeps failing. Really bad. I can't reset my password, I cant login with my UK number as it says it cant send SMSes to that number. Really weird and frankly, annoying.",
        "Not worth the time.",
        "Impossible to use",
        "The app does not send SMS when requiring validation",
        "Can't not use unless you have Spanish number",
        "Can't log in,i have uk number and they can't send the check code on my number. so it is unusable app for me. 1 star is too much",
        "Para México tiene por default la clave antigua con 521 en lugar de 52 y no se puede usar.",
        "Terrible. Same problem as reported by many others. Cannot send sms to a valid number. You really need to get better programmers",
        "Neither app or wepapp is working. Managed to register using web as app won't accept email/phone or google,but can't login. When trying to use webapp it goes as far as redirecting and asking for app download which doesn't work",
        "No way to register an account",
        "Cada vez funciona peor, la última gran experiencia es que ahora te cargan el coste del viaje tras cancelarlo y avisar al conductor. Justifican que el conductor me avisó de su llegada, no recibí llamada ni mensaje alguno, tras solicitar esta evidencia me dicen que lamentan que no esté de acuerdo y sigo sin mi dinero por un viaje cancelado. Usen otras apps de viaje.",
        "Can't connect with my SIM. Verification SMS can not be sent",
        "Just reinstalled, login with any method is impossible.",
        "Don't bother unless you have a Spanish number.",
        "i cant get access to my account 🤨",
        "Nunca me enviaron el código de verificación, intenté antes de mi viaje desde mi hogar en los estados unidos y otra vez cuando llegué en España pero nunca funcionó. Tengo Google Fi con el plan internacional sin límites. Fue muy frustrante.",
        "Unreliable app. When I ordered taxi at night , right after registration they immediately blocked account. They requested very personal information like photo of passport and photo of bank card to unlock account. They checked it next day only. It's been about 6 months and I've still not been used a service there. No cars available , it it is very expensive. Just decided to share my experience before I delete this junk app",
        "La app está bien. Enhorabuena al equipo Engineering. El servicio mediocre. Si tienes un bebé olvídate de ellos. No tienen sillas de bebé. Y si les reservas no aparecen.",
        "They should fix picking points on Bcn Airport. Scheduled on floor 0, driver made me go to 3rd floor and cancel it after.",
        "Very disappointing experience with Cabify. Despite specifying easy Madrid address, the driver parked several streets away, making me walk a long distance. Cabify cars aren’t allowed in taxi lanes, so they charge you while waiting elsewhere without explaining. Customer service fully charged me, refusing my appeal in the middle of the night. Even with no high demand, Cabify drivers take 12-15 minutes to arrive, unlike many empty taxis. This inconvenience and lack of transparency is unacceptable.",
        "Tourists literally cannot create an account.",
        "Pésima experiencia en la mayoría de los viajes y la atención al cliente no hace nada y no les importa el mal trato de los choferes hacia los pasajeros.",
        "As per almost all reveiws on here can't use it without a Spanish sim. I'm here for a month. I'll be getting taxis everywhere, I'm trying to give you money and you won't take it. And no I don't want to go to your help page - fix your app to work with foreign sims and watch your revenue double from the tourists who want to use your app! 🤦",
        "Bring back the obstacle avoidance game.",
        "La aplicacion es muy mala. Tiene muchos bugs criticos, cuando hay errores nunca te permite saber donde te equivocaste y como recuperarte del error. No puedo alcanzar jamas mis objetivos con esta app y termino siempre usando Uber porque la app y la web de Cabify dan realmente muy malas experiencias de usuaroo",
        "Won't send SMS so can't sign up!!",
        "Te ponen conductores que están a 15 minutos de tu casa, tardan mas de 20 minutos en llegar porque tienen un viaje entre medio, te ves forzado a cancelar el viaje y pagar el precio de cancelacion. No importa que este en contra de las normas, voy a pedir la devolucion a través de mi banco",
        "1. Los sistemas de ayuda inexistentes también mienten cuando responden. Tuve una queja abierta durante dos días cuando alguien respondió, luego, a los tres minutos de responder con dos días de retraso, dijeron que cerrarían mi chat y considerarían el asunto resuelto. 2. Su sistema GPS es un desastre que proporciona rutas muy incorrectas para el camino que resulta en cargos elevados y hasta el punto de recogida que a menudo resulta en cancelaciones.",
        "Cannot register with not Spanish phone",
        "La aplicación realiza cobros después de finalizar el recorrido. El cobro estimado y el final pueden variar bastante. A mi me cobraron 40 euros por un viaje que tenía un \"precio estimado\" de 11 euros. Se debería de cobrar de inmediato cuando solicitas el viaje no después de esté y que esté \"dispuesto a cambios\".",
        "Won't even let me register to start using.",
        "First of all. There's nothing executive about the executive type of vehicle choice which costs a little bit more. Clearly they do not inspect the vehicles that go in that category. 80% of the time you will end up getting picked up buy a piece of junk as if you ordered the cheaper option. When I want to be picked up in a nicer vehicle I use Uber's Comfort option. Uber actually screens the vehicles that go into that category and you get what you paid extra for.",
        "App will not send verification code to my phone properly so I can't even finish setup of my account",
        "Very bad app. I am trying to make an account in Spain, but I can not register with my NL number. What a joke.",
        "Downloaded, reloaded and still won't get past 'we cannot send you a text'. Therefore cannot setup an account or use. At the point that I have tried everything and on 2 seperate phones and ultimatly a 1.7* review, i will pass on sending you data. If you're going to put a worldwide transpory app together, get it rigjt from the start. You have no idea how your disfunctionality affects people",
        "En Buenos Aires de Vicente Lopez al Obelisco no me permite ir por Autopista Illia por culpa del peaje/telepase que La Aplicacion No Soporta. Me elije un camino Mucho Muuucho mas lento (12 minutos segun waze) por Avenida Libertador en lugar de ir por autopista. CaTasTroFiCo siendo una de las rutas mas importantes/habituales en buenos aires para llegar a microcentro.",
        "1 estrella porque no puedo usar siquiera la aplicación. Tenía previamente Easy Taxi y me forzó a realizar al cambio a Cabify. Con esta app no puedo loguearme de ninguna manera (ni SSO, ni e-mail ni número de teléfono). Me comunique con soporte en reiteradas oportunidades y no dan ningún tipo de solución, más que \"lo estamos revisando\".",
        "Sigue igual. Mejoró, hubo una época con muchos autos pero ahora de nuevo hay pocos. Encima te cobran el extra por el executive y son los mismos conductores y autos. ENCIMA AHORA TIENE PUBLICIDAD LA APLICACIÓN. SON UNOS LADRONES",
        "Works with international numbers now, via Whatsapp",
        "The customer support is terrible in the HELP section. They respond the same thing OVER and over and can't grasp the situation or don't care. A lot of dishonest drivers on the app. I had a guy keep driving after he dropped me off. I contacted support because they charged me a ton more. Support charged me AGAIN and said a refund will take 2 to 25 business days. They steal from you. Do not use! And I'm sure they will say, in order to validate. Use help. Nah. RUN",
        "I've this app for some time and used in several countries. I just installed it again and since it did accept my password I got a code to reset and it will not process the new password because \"something went wrong\". Tried it twice",
        "nice",
        "Todo ben hasta que necesidad ponerte en contacto con soporte. 5 mensajes intentando explicar la situación de como un conductor nos estaba esperando a casi 100 metros del punto de encuentro, nos pidió que cancelaramos y según nos acercábamos se iba alejando cada vez más. Dejo la app abierta 20 min para respirar a que cancelarnos nostros. El dpto de soporte ha enviado la misma respuesta plantilla 6 veces, días lo que digas. Despedid a todos los agentes de soporte y usad chstgpt porfavor...",
        "Precios accesibles, alta demanda en carros y no se demoran en aceptar y recogerte, buenos servicios, al menos en Colombia muy buenas personas las que te recogen, muy amables",
        "Never got a response from any cab via app",
        "Can't sign up with a uk number.",
        "Complete scammers, dont download this app. I topped up my account, ordered a cab, the cab was showing in another location in the map and the pick up point was in another location. I tried to find the cab, then he cancelled me, the receipt said 12.5 i was charged 17.7 but not from my top up but from my card. A complete shame. And also i cannot even contact them. You cannot use their mopeds as an foreigner, so they just took 20 euros from me, with no prior info about that.while i can rent ahouse😂",
        "THIS APP ONLY EXISTS TO STEAL YOUR MONEY. My card was charged for a trip that never happened, their customer service team reviewed the situation, agreed with me yet never provided a refund nor credit for it. Their final answer was, \"yes we charged you, we can't do anything else to help you\", what kind of solution is that? What kind of professional company does this? Easy answer, Cabify.",
        "Works fine",
        "Worked once in 8 attempts, save yourself the frustration and call a taxi company directly and WhatsApp with them",
        "As non native phone number could not register no use what so ever",
        "Doesn't work without Spanish number and WhatsApp.",
        "No funciona. No le deja registrar",
        "\"We can't send the sms\". My number is correct so can't even register on the app or get past setup. Totally useless and a waste of time.",
        "cant register without whatsapp. when I enter my foreign (not argentina) whatsapp number it says \"cant send sms\". what a joke developers",
        "Can't get it to work at all",
        "No puedo iniciar sesión con ningún correo, mi número actual no me deja ingresar y lo tengo hace años y no hay ninguna opción para contactar a soporte si no inicias sesión",
        "It doesn't work if you don't have a Spanish phone number (but it implies that customers from any country can use it), you get asked to contact their customer support for them to \"help\" you, they try to blame the issue on the user by saying some nonsense about the problem being with your phone permissions and that there's no evidence of errors on their side, but then openly admit it works with Spanish phone numbers. They're either extremely lazy and incompetent, or are acting in bad faith",
        "Doesn't work. Just keeps telling me that it can't send SMS... Yet says I should receive code via WhatsApp 😕",
        "pésimo servicio de atención al cliente",
        "I agree with all the other one star reviews here. The app is broken. Doesn't let you set up an account because there is no way to do it without entering a phone number but it just comes up with an error message that no SMS could be sent.",
        "I am a tourist with no spanish number, why give me the option to choose my country number and waste my time then reject it!",
        "High quality",
        "App never sends verification SMS. App does not work",
        "The app is so slow. It doesn't open, and it doesn't work.",
        "Spamming with notifications that can not be disabled",
        "Useless, could not even create an account with Dutch phone number: \"we could not send the sms\"",
        "No se hacen cargo de sus errores. Me tocó una experiencia muy mala en un viaje de 40€ y su respuesta fue darme 3€ en un próximo viaje, lamentable. Ref. #57277498",
        "Es una app buena, debería de darse más expansión, pero es buena, segura y ágil.",
        "Wouldn't move pass the registration screen. Continued to have error \"couldn't send SMS\"",
        "Te dicen que están a 9 min del punto de recogida y luego nadie acepta el viaje porque esperan recorridos más largos. Y el precio va subiendo 2€ cada 10 min. Cuándo intentas reservar otra vez. Cabify es completamente inútil fuera de los grandes núcleos urbanos.",
        "Excelente conductor y vehículo.",
        "Being on a constant lookout for better riding apps, I'd appreciate knowing if I can use it in my area BEFORE wasting time & storage to install it then get shocked at the hidden info. Plz state where the app offers its services in description instead of forcing clients to check company website and still learn nothing in the process. It won't even make you break a sweat. Uninstalling app now.",
        "Quise pedir un Taxi un jueves a las 10pm en Tlalnepantla por Mundo E y no había ningún auto disponible, el precio era mejor que Uber y Didi pero tuve que pedir un Uber porque por más de 5min no me asignaba auto.",
        "Just as good as Uber, but much cheaper",
        "Terrible app. Cannot register with non-spanish number, tells me my email is already registered even though I've never heard of this app before. Very bad experience. Would not recommend.",
        "I can't log in to my account. I've tried contacting you by phone for over 23 minutes and no answer. Also the support email didn't work. Waste of time.",
        "Cannot get verification code with US phone number. Really stupid app.",
        "Could not create account (could not send SMS)",
        "Can use numbers from other countries to register. Poor app",
        "Estoy teniendo problemss para acceder a la app siendo que puedo entrar por la pagina web! No hay manera de contactarse con nadie. Pongan un chat bot!! Esta mal hecho el login de la app!!? Por favor que alguien se contacté!",
        "Pésimo! Me bloquearon mi cuenta sin darme algún motivo o razón Hay un viaje que me cobraron a pesar de que el conductor cancelo el viaje además el soporte al cliente no funciona"
    ]
}